{"index":{"_id":1}}
{"Surah":"سورة الفَاتِحَة","ayah":"1:1","Surah_EN_transliteration":"Al-Faatiha","Surah_EN_translation":"The Opening","Surah_Revelation":"Meccan","Juz_sw":0,"Manzil_sw":1,"hisQ_sw":1,"Juz":0,"Manzil":1,"Ruku":1,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ","Urdu":"اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔","English":"In the name of Allah, the Gracious, the Merciful.","German":"Im Namen Allahs, des Gnädigen, des Barmherzigen.* ","Spanish":" En el nombre de Al-lah, el Clemente, el Misericordioso.","French":"Au nom d’Allāh, le Gracieux, le Miséricordieux.","UrduTS":"(میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) بار بار رحم کرنے والا ہے (پڑھتا ہوں) ۔","a":1,"s":1}
{"index":{"_id":2}}
{"Surah":"سورة الفَاتِحَة","ayah":"1:2","Surah_EN_transliteration":"Al-Faatiha","Surah_EN_translation":"The Opening","Surah_Revelation":"Meccan","Juz":0,"Manzil":1,"Ruku":1,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَٰلَمِينَ","Urdu":"تمام حمد اللہ ہی کے لئے ہے جو تمام جہانوں  کاربّ ہے۔","English":"All praise belongs to Allah, Lord of all the worlds,","German":"Aller Preis gehört Allah, dem Herrn der Welten,","Spanish":" Toda alabanza pertenece a Al-lah <em>sólo, </em>Señor de todos los mundos,","French":"Toutes les louanges appartiennent à Allāh, le Seigneur de tous les mondes,","UrduTS":"ہر (قسم کی) تعریف کا اللہ (ہی) مستحق ہے (جو) تمام جہانوں کا رب (ہے)۔ ","a":2,"s":1}
{"index":{"_id":3}}
{"Surah":"سورة الفَاتِحَة","ayah":"1:3","Surah_EN_transliteration":"Al-Faatiha","Surah_EN_translation":"The Opening","Surah_Revelation":"Meccan","Juz":0,"Manzil":1,"Ruku":1,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ٱلرَّحْمَٰنِ ٱلرَّحِيمِ","Urdu":" ۔ بے انتہا رحم کرنے والا، بن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔","English":"The Gracious, the Merciful,","German":"dem Gnädigen, dem Barmherzigen,","Spanish":" El Clemente, el Misericordioso,","French":"Le Gracieux, le Miséricordieux,","UrduTS":"بے حد کرم کرنے والا‘ بار بار رحم کرنے والا۔ ","a":3,"s":1}
{"index":{"_id":4}}
{"Surah":"سورة الفَاتِحَة","ayah":"1:4","Surah_EN_transliteration":"Al-Faatiha","Surah_EN_translation":"The Opening","Surah_Revelation":"Meccan","Juz":0,"Manzil":1,"Ruku":1,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"مَٰلِكِ يَوْمِ ٱلدِّينِ","Urdu":"جزا سزا کے دن کا مالک ہے۔","English":"Master of the Day of Judgment.","German":"dem Meister des Gerichtstages.","Spanish":" Dueño del Día del Juicio.","French":"Le Maître du Jour du Jugement.","UrduTS":"(اور) جزا سزا کے وقت کا مالک ہے۔ ","a":4,"s":1}
{"index":{"_id":5}}
{"Surah":"سورة الفَاتِحَة","ayah":"1:5","Surah_EN_transliteration":"Al-Faatiha","Surah_EN_translation":"The Opening","Surah_Revelation":"Meccan","Juz":0,"Manzil":1,"Ruku":1,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ","Urdu":" تیری ہی ہم عبادت کرتے ہیں اور تجھی سے ہم مدد چاہتے ہیں۔","English":"Thee alone do we worship and Thee alone do we implore for help.","German":"Dir allein dienen wir, und zu Dir allein flehen wir um Hilfe.","Spanish":" A Ti sólo te adoramos y a Ti sólo imploramos ayuda.","French":"C’est Toi Seul que nous adorons, et c’est de Toi Seul que nous implorons le secours.","UrduTS":"(اے خدا)! ہم تیری ہی عبادت کرتے ہیں اور تجھ سے ہی مدد مانگتے ہیں۔ ","a":5,"s":1}
{"index":{"_id":6}}
{"Surah":"سورة الفَاتِحَة","ayah":"1:6","Surah_EN_transliteration":"Al-Faatiha","Surah_EN_translation":"The Opening","Surah_Revelation":"Meccan","Juz":0,"Manzil":1,"Ruku":1,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ٱهْدِنَا ٱلصِّرَٰطَ ٱلْمُسْتَقِيمَ","Urdu":"ہمیں سیدھے راستہ پر چلا۔","English":"Guide us in the right path  — ","German":"Führe uns auf den geraden Weg,","Spanish":" Dirígenos por el camino recto,","French":"Guide-nous sur le droit chemin –","UrduTS":"ہمیں سیدھے راستے پر چلا۔ ","a":6,"s":1}
{"index":{"_id":7}}
{"Surah":"سورة الفَاتِحَة","ayah":"1:7","Surah_EN_transliteration":"Al-Faatiha","Surah_EN_translation":"The Opening","Surah_Revelation":"Meccan","Ruku_sw":1,"Ruku_sw_per_Juz":1,"Juz":0,"Manzil":1,"Ruku":1,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"صِرَٰطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِمْ وَلَا ٱلضَّآلِّينَ","Urdu":"ان لوگوں کے راستہ پر جن پر تُو نے انعام کیا۔ جن پر غضب نہیں کیا گیا اور جو گمراہ نہیں ہوئے۔","English":"The path of those on whom Thou hast bestowed <i>Thy</i> blessings, those who have not incurred <i>Thy</i> displeasure, and those who have not gone astray.","German":"den Weg derer, denen Du Gnade erwiesen hast, die nicht (Dein) Missfallen erregt haben und die nicht irregegangen sind.*","Spanish":" El camino de aquellos a quienes Tú has concedido <em>Tus </em> bendiciones, de los que no han incurrido en <em>el </em>enojo y de los que no se han extraviado.","French":"Le chemin de ceux à qui Tu as accordé <em>Tes</em> faveurs, pas <em>celui</em> de ceux qui se sont attiré le courroux, ni de ceux qui se sont égarés.","UrduTS":"ان لوگوں کے راستے پر جن پر تو نے انعام کیا ہے جن پر نہ تو تیرا (بعد) میں غضب نازل ہوا (ہے) اور نہ وہ (بعد میں) گمراہ (ہو گئے) ہیں۔ ","a":7,"s":1}
{"index":{"_id":8}}
{"Surah":"سورة البَقَرَة","ayah":"2:1","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":0,"Manzil":1,"Ruku":2,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ","Urdu":"اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔","English":"In the name of Allah, the Gracious, the Merciful.","German":"Im Namen Allahs, des Gnädigen, des Barmherzigen.","Spanish":" En el nombre de Al-lah, el Clemente, el Misericordioso.","French":"Au nom d’Allāh, le Gracieux, le Miséricordieux.","UrduTS":"(میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں۔) ","a":1,"s":2}
{"index":{"_id":9}}
{"Surah":"سورة البَقَرَة","ayah":"2:2","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz_sw":1,"Juz":1,"Manzil":1,"Ruku":2,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":" الٓمٓ","Urdu":"اٴَنَااللہُ اٴَعْلَمُ: میں اللہ سب سے زیادہ جاننےوالا ہوں۔","English":"Alif Lam Mim.","German":"Alif Lâm Mîm.*","Spanish":" Alif Lam Mim.","French":"Alif Lām Mīm (Je suis Allāh, le Plus-Savant).","UrduTS":"میں اللہ سب سے زیادہ جاننے والا ہوں۔ ","a":2,"s":2}
{"index":{"_id":10}}
{"Surah":"سورة البَقَرَة","ayah":"2:3","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":2,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ذَٰلِكَ ٱلْكِتَٰبُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِّلْمُتَّقِينَ","Urdu":" یہ ”وہ“ کتاب ہے۔ اس میں کوئی شک نہیں۔ ہدایت دینے والی ہے متقیوں کو۔","English":"This is a perfect Book; there is no doubt in it; <i>it is</i> a guidance for the righteous,","German":"Dies ist ein vollkommenes Buch; es ist kein Zweifel darin: eine Richtschnur für die Rechtschaffenen;","Spanish":" Éste es un Libro perfecto; no hay duda en él; es una guía para los justos,","French":"Ceci est le Livre <em>parfait</em>, dans lequel il n’y a pas de doute. <em>C’est</em> une direction pour les gens pieux,","UrduTS":"یہی کامل کتاب ہے‘ اس (امر) میں کوئی شک نہیں‘ متقیوں کو ہدایت دینے والی ہے۔ ","a":3,"s":2}
{"index":{"_id":11}}
{"Surah":"سورة البَقَرَة","ayah":"2:4","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":2,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ٱلَّذِينَ يُؤْمِنُونَ بِٱلْغَيْبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقْنَٰهُمْ يُنفِقُونَ","Urdu":"جو لوگ غیب پر ایمان لاتے ہیں اور نماز قائم کرتے ہیں اور جو کچھ ہم انہیں رزق دیتے ہیں اس میں سے خرچ کرتے ہیں۔","English":"Who believe in the unseen and observe Prayer, and spend out of what We have provided for them;","German":"die da glauben an das Ungesehene und das Gebet verrichten und spenden von dem, was Wir ihnen gegeben haben;","Spanish":" Quienes creen en lo invisible y observan la Oración y gastan de lo que les hemos provisto;","French":"Qui croient à l’invisible, qui observent la Prière, et qui dépensent de ces dons <em>et richesses</em> que Nous leur avons accordés ;","UrduTS":"جو غیب پر ایمان لاتے اور نماز کو قائم رکھتے ہیں اور جو (کچھ) ہم نے انہیں دیا ہے اس میں سے خرچ کرتے رہتے ہیں۔ ","a":4,"s":2}
{"index":{"_id":12}}
{"Surah":"سورة البَقَرَة","ayah":"2:5","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":2,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَٱلَّذِينَ يُؤْمِنُونَ بِمَآ أُنزِلَ إِلَيْكَ وَمَآ أُنزِلَ مِن قَبْلِكَ وَبِٱلْءَاخِرَةِ هُمْ يُوقِنُونَ","Urdu":"اور وہ لوگ جو اس پر ایمان لاتے ہیں جو تیری طرف اُتارا گیا اور اس پر بھی جو تجھ سے پہلے اُتارا گیا اور وہ آخرت پر یقین رکھتے ہیں۔","English":"And who believe in that which has been revealed to thee, and that which was revealed before thee, and they have firm faith in what is <i>yet</i> to come.","German":"und die glauben an das, was dir offenbart worden, und an das, was vor dir offenbart ward, und fest auf das bauen, was kommen wird.","Spanish":" Y creen en lo que te ha sido revelado y en lo que fue revelado con anterioridad a ti y tienen una fe firme en lo que aún está por venir.","French":"Et qui croient à ce qui t’a été révélé, et à ce qui a été révélé avant ton avènement, et qui croient fermement à ce qui est <em>encore</em> à venir.","UrduTS":"اور جو تجھ پر نازل کیا گیا ہے یا جو تجھ سے پہلے نازل کیا گیا تھا اس پر ایمان لاتے ہیں اورآئندہ ہونے والی (موعود باتوں) پر( بھی ) یقین رکھتے ہیں۔ ","a":5,"s":2}
{"index":{"_id":13}}
{"Surah":"سورة البَقَرَة","ayah":"2:6","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":2,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"أُو۟لَٰٓئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ ۖ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ","Urdu":" یہی وہ لوگ ہیں جو اپنے ربّ کی طرف سے ہدایت پر قائم ہیں اور یہی ہیں وہ جو فلاح پانے والے ہیں۔","English":"It is they who follow the guidance of their Lord and it is they who shall prosper.","German":"Sie sind es, die der Führung ihres Herrn folgen, und sie werden Erfolg haben.","Spanish":" Son los que siguen la guía de su Señor y son los que alcanzarán la felicidad.","French":"Ceux-là suivent la voie indiquée par leur Seigneur et ce sont eux qui prospéreront.","UrduTS":"یہ لوگ (یقیناً) اس ہدایت پر (قائم) ہیں جو ان کے رب کی طرف سے (آئی) ہے اور یہی لوگ کامیاب ہونے والے ہیں۔ ","a":6,"s":2}
{"index":{"_id":14}}
{"Surah":"سورة البَقَرَة","ayah":"2:7","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":2,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"إِنَّ ٱلَّذِينَ كَفَرُوا۟ سَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ","Urdu":" یقیناً وہ لوگ جنہوں نے کفر کیا (اس حال میں کہ) برابر ہے اُن پر خواہ تُو انہیں ڈرائے یا نہ ڈرائے، وہ ایمان نہیں لائیں گے۔","English":"Those who have disbelieved  —  it being equal to them whether thou warn them or warn them not  —  they will not believe.","German":"Die nicht geglaubt haben – und denen gleich ist, ob du sie warnst oder nicht warnst –, sie werden nicht glauben.","Spanish":" Los que son incrédulos –les es igual que les adviertas o no– no creerán.","French":"<em>Quant à</em> ceux qui n’ont pas cru – cela leur est égal que tu les avertisses ou que tu ne les avertisses pas – ils ne croiront pas.","UrduTS":"ایسے لوگ جنہوں نے کفر کیا ہے (اور) تیرا ان کو ڈرانا یا نہ ڈرانا ان کے لئے یکساں (اثر پیدا کرتا) ہے (جب تک وہ اس حالت کو نہ بدلیں) ایمان نہیں لائیں گے۔ ","a":7,"s":2}
{"index":{"_id":15}}
{"Surah":"سورة البَقَرَة","ayah":"2:8","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Ruku_sw":2,"Ruku_sw_per_Juz":2,"Juz":1,"Manzil":1,"Ruku":2,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ ۖ وَعَلَىٰٓ أَبْصَٰرِهِمْ غِشَٰوَةٌ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ","Urdu":" اللہ نے ان کے دلوں پر مہر لگا دی ہے اور ان کی شنوائی پر بھی۔ اور ان کی آنکھوں پر پردہ ہے۔ اور ان کے لئے بڑا عذاب (مقدر) ہے۔","English":"Allah has set a seal on their hearts and their ears, and over their eyes is a covering; and for them is a great punishment.","German":"Versiegelt hat Allah ihre Herzen und ihre Ohren, und über ihren Augen liegt eine Hülle, und ihnen wird schwere Strafe.","Spanish":" Al-lah ha puesto un sello en sus corazones y en sus oídos; y un velo cubre sus ojos; y para ellos hay <em>reservado </em>un grave castigo.","French":"Allāh a scellé leur cœur et leurs oreilles ; ils ont un voile sur les yeux. Et pour eux il y a un très grand châtiment.","UrduTS":"اللہ نے ان کے دلوں پر اور ان کے کانوں پر مہر کر دی ہے اور ان کی آنکھوں پر پردہ (پڑا ہوا) ہے اور ان کے لئے ایک بڑا عذاب (مقدر) ہے۔ ","a":8,"s":2}
{"index":{"_id":16}}
{"Surah":"سورة البَقَرَة","ayah":"2:9","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ وَبِٱلْيَوْمِ ٱلْءَاخِرِ وَمَا هُم بِمُؤْمِنِينَ","Urdu":"اور لوگوں میں سے کچھ ایسے بھی ہیں جو کہتے ہیں کہ ہم اللہ پر ایمان لے آئے اور یومِ آخر پر بھی، حالانکہ وہ ایمان لانے والے نہیں ہیں۔","English":"And of the people there are some who say, ‘We believe in Allah and the Last Day;’ while they are not believers at all.","German":"Unter den Leuten sind solche, die sagen: \"Wir glauben an Allah und an den Jüngsten Tag\", und sind gar nicht Gläubige.","Spanish":" Y entre los hombres hay algunos que dicen: “creemos en Al-lah y en el Último Día”; pero no son en absoluto creyentes.","French":"Et parmi les hommes, certains disent : « Nous croyons en Allāh et au Jour Dernier ; et pourtant ce sont des mécréants.","UrduTS":"اور بعض لوگ ایسے بھی ہیں جو کہتے ہیں کہ ہم اللہ پر اور آنے والے دن پر ایمان رکھتے ہیں‘ حالانکہ وہ ہرگز ایمان نہیں رکھتے۔ ","a":9,"s":2}
{"index":{"_id":17}}
{"Surah":"سورة البَقَرَة","ayah":"2:10","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"يُخَٰدِعُونَ ٱللَّهَ وَٱلَّذِينَ ءَامَنُوا۟ وَمَا يَخْدَعُونَ إِلَّآ أَنفُسَهُمْ وَمَا يَشْعُرُونَ","Urdu":"وہ اللہ کو اور ان لوگوں کو جو ایمان لائے دھوکہ دینے کی کوشش کرتے ہیں۔ جبکہ وہ اپنے سوا کسی اور کو دھوکہ نہیں دیتے۔ اور وہ شعور نہیں رکھتے۔ ","English":"They would deceive Allah and those who believe, and they deceive none but themselves; only they perceive <i>it</i> not.","German":"Sie möchten Allah betrügen und diejenigen, die gläubig sind; doch sie betrügen nur sich selbst; allein sie begreifen es nicht.","Spanish":" Tratan de engañar a Al-lah y a los que creen, y no engañan a nadie sino a ellos mismos; pero no se dan cuenta <em>de ello.</em>","French":"Ils cherchent à tromper Allāh et les croyants, alors qu’ils ne trompent qu’eux-mêmes ; seulement, ils ne s’<em>en</em> rendent pas compte.","UrduTS":"وہ اللہ کو اور ان لوگوں کو جو ایمان لائے ہیں دھوکا دینا چاہتے ہیں‘ مگر (واقعہ میں) وہ اپنے سوا کسی کو دھوکہ نہیں دیتے۔ اور وہ سمجھتے نہیں۔ ","a":10,"s":2}
{"index":{"_id":18}}
{"Surah":"سورة البَقَرَة","ayah":"2:11","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"فِى قُلُوبِهِم مَّرَضٌ فَزَادَهُمُ ٱللَّهُ مَرَضًا ۖ وَلَهُمْ عَذَابٌ أَلِيمٌۢ بِمَا كَانُوا۟ يَكْذِبُونَ","Urdu":"ان کے دلوں میں بیماری ہے۔ پس اللہ نے ان کو بیماری میں بڑھا دیا۔ اور ان کے لئے بہت دردناک عذاب (مقدر) ہے بوجہ اس کے کہ وہ جھوٹ بولتے تھے۔","English":"In their hearts was a disease, and Allah has increased their disease to them; and for them is a grievous punishment because they lied.","German":"In ihren Herzen war Krankheit, und Allah hat ihre Krankheit vermehrt*; und eine qualvolle Strafe wird ihnen, weil sie logen.","Spanish":" Había una enfermedad en sus corazones, y Al-lah les ha agravado la enfermedad; y tendrán un penoso castigo porque solían mentir.","French":"Il y a une maladie dans leur cœur et Allāh a aggravé leur maladie. Et pour eux, il y a un châtiment douloureux parce qu’ils avaient l’habitude de mentir.","UrduTS":"ان کے دلوں میں ایک بیماری تھی پھر اللہ نے ان کی بیماری کو (اور بھی) بڑھا دیا اور انہیں ایک دردناک عذاب پہنچ رہا ہے کیونکہ وہ جھوٹ بولا کرتے تھے۔ ","a":11,"s":2}
{"index":{"_id":19}}
{"Surah":"سورة البَقَرَة","ayah":"2:12","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا۟ فِى ٱلْأَرْضِ قَالُوٓا۟ إِنَّمَا نَحْنُ مُصْلِحُونَ","Urdu":" اور جب انہیں کہا جاتا ہے کہ زمین میں فساد نہ کرو تو وہ کہتے ہیں ہم تو محض اصلاح کرنے والے ہیں۔","English":"And when it is said to them: ‘Create not disorder on the earth,’ they say: ‘We are only promoters of peace.’","German":"Und wenn ihnen gesagt wird: \"Stiftet kein Unheil auf Erden\", antworten sie: \"Wir sind nur Förderer des Friedens.\"","Spanish":" Y cuando se les dice: “no creéis el desorden en la tierra”, responden: “Sólo trabajamos por la paz”.","French":"Et lorsqu’on leur dit : « Ne créez pas de désordre sur la terre, » ils répondent : « Nous ne faisons que préserver la paix. »","UrduTS":"اور جب ان سے کہا جائے (کہ) زمین میں فساد نہ کرو‘ تو کہتے ہیں‘ ہم تو صرف اصلاح کرنے والے ہیں۔ ","a":12,"s":2}
{"index":{"_id":20}}
{"Surah":"سورة البَقَرَة","ayah":"2:13","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"أَلَآ إِنَّهُمْ هُمُ ٱلْمُفْسِدُونَ وَلَٰكِن لَّا يَشْعُرُونَ","Urdu":"خبردار! یقیناً وہی ہیں جو فساد کرنے والے ہیں لیکن وہ شعور نہیں رکھتے۔","English":"Beware! it is surely they who create disorder, but they do not perceive <i>it</i>.","German":"Höret! gewiss sind sie es, die Unheil stiften; allein sie begreifen es nicht.","Spanish":" ¡Cuidado!; son ciertamente ellos los que crean el desorden, pero no se dan cuenta <em>de ello.</em>","French":"Attention ! Ce sont sûrement eux qui créent le désordre, mais ils ne s’ <em>en</em> rendent pas compte.","UrduTS":"(کان کھول کر) سنو! یہی لوگ بلاشبہ فساد کرنے والے ہیں‘ مگر وہ (اس حقیقت کو) سمجھتے نہیں۔ ","a":13,"s":2}
{"index":{"_id":21}}
{"Surah":"سورة البَقَرَة","ayah":"2:14","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ كَمَآ ءَامَنَ ٱلنَّاسُ قَالُوٓا۟ أَنُؤْمِنُ كَمَآ ءَامَنَ ٱلسُّفَهَآءُ ۗ أَلَآ إِنَّهُمْ هُمُ ٱلسُّفَهَآءُ وَلَٰكِن لَّا يَعْلَمُونَ","Urdu":"اور جب ان سے کہا جاتا ہے ایمان لے آؤ جیسا کہ لوگ ایمان لے آئے ہیں ۔ کہتے ہیں کیا ہم ایمان لے آئیں جیسے بے وقوف ایمان لائے ہیں۔ خبردار! وہ خود ہی تو ہیں جو بے وقوف ہیں۔ لیکن وہ علم نہیں رکھتے۔","English":"And when it is said to them, ‘Believe as <i>other</i> people have believed,’ they say: ‘Shall we believe as the foolish have believed?’ Beware! it is surely they that are foolish, but they do not know.","German":"Und wenn ihnen gesagt wird: \"Glaubet, wie andere geglaubt haben\", so sprechen sie: \"Sollen wir glauben, wie die Toren glaubten?\" Höret! sie sind die Toren, allein sie wissen es nicht.","Spanish":" Y cuando se les dice: “Creed como han creído <em>otras </em> personas”, responden: “¿Acaso hemos de creer como han creído los insensatos?” ¡Cuidado! ellos son ciertamente los insensatos, pero no lo saben.","French":"Et lorsqu’on leur dit : « Croyez <em>en Allāh</em> comme les gens ont cru <em>en Lui</em>, » ils répondent : « Devons-nous croire comme ont cru les sots ? » Attention ! Ce sont sûrement eux qui sont sots, mais ils ne <em>le</em> savent pas.","UrduTS":"اور جب انہیں کہا جائے کہ (اسی طرح) ایمان لاٶ‘ جس طرح (دوسرے) لوگ ایمان لائے ہیں تو کہتے ہیں کہ کیا ہم (اس طرح) ایمان لائیں جس طرح بیوقوف (لوگ) ایمان لائے ہیں یاد رکھو! (یہ جھوٹ بول رہے ہیں) وہ خود ہی بیوقوف ہیں مگر (اس بات کو) جانتے نہیں۔ ","a":14,"s":2}
{"index":{"_id":22}}
{"Surah":"سورة البَقَرَة","ayah":"2:15","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذَا لَقُوا۟ ٱلَّذِينَ ءَامَنُوا۟ قَالُوٓا۟ ءَامَنَّا وَإِذَا خَلَوْا۟ إِلَىٰ شَيَٰطِينِهِمْ قَالُوٓا۟ إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِءُونَ","Urdu":"اور جب وہ ان لوگوں سے ملتے ہیں جو ایمان لائے تو کہتے ہیں ہم بھی ایمان لے آئے اور جب اپنے شیطانوں کی طرف الگ ہو جاتے ہیں تو کہتے ہیں یقیناً ہم تمہارے ساتھ ہیں۔ ہم تو (ان سے) صرف تمسخر کر رہے تھے۔","English":"And when they meet those who believe, they say: ‘We believe;’ but when they are alone with their ringleaders, they say: ‘We are certainly with you; we are only mocking.’","German":"Und wenn sie mit denen zusammentreffen, die glauben, sagen sie: \"Wir glauben\"; sind sie jedoch allein mit ihren Bonzen, sagen sie: \"Gewiss sind wir mit euch, wir treiben nur Spott.\"","Spanish":" Y cuando se reúnen con los que creen, dicen: “Creemos”; pero cuando están solos con sus cabecillas, dicen: “En realidad estamos con vosotros; únicamente nos burlamos”.","French":"Et quand ils rencontrent les croyants, ils disent : « Nous croyons <em>en Allāh</em> « ; mais quand ils se trouvent seuls avec leurs meneurs, ils <em>leur</em> disent : « Nous sommes assurément de votre parti ; nous ne faisions que nous moquer <em>d’eux.</em> »","UrduTS":"اور جب وہ ان لوگوں سے ملیں جو ایمان لائے ہیں تو کہہ دیتے ہیں کہ ہم تو (اس رسول کو) مانتے ہیں اور جب وہ اپنے سرغنوں سے علیحدگی میں ملیں تو کہہ دیتے ہیں کہ ہم یقیناً تمہارے ساتھ ہیں ہم تو صرف (ان مومنوں سے) ہنسی کر رہے تھے۔ ","a":15,"s":2}
{"index":{"_id":23}}
{"Surah":"سورة البَقَرَة","ayah":"2:16","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ٱللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِى طُغْيَٰنِهِمْ يَعْمَهُونَ","Urdu":" اللہ (ضرور) اُن کے تمسخر کا جواب دے گا۔ اور اُنہیں کچھ عرصہ مہلت دے گا کہ وہ اپنی سرکشیوں میں بھٹکتے رہیں۔ ","English":"Allah will punish their mockery and will let them continue in their transgression, wandering blindly.","German":"Allah wird sie Spott lehren und wird sie in ihren Freveln verharren lassen, dass sie verblendet irregehen.","Spanish":" Al-lah les castigará por su burla y les dejará que continúen en su trasgresión, vagando ciegamente.","French":"Allāh <em>les</em> punira <em>pour</em> leur moquerie et les laissera errer pour quelque temps dans leur transgression comme des affolés.","UrduTS":"اللہ انہیں (ان کی) ہنسی کی سزا دے گا اور انہیں اپنی سرکشیوں میں بہکتے ہوئے چھوڑ دے گا۔ ","a":16,"s":2}
{"index":{"_id":24}}
{"Surah":"سورة البَقَرَة","ayah":"2:17","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"أُو۟لَٰٓئِكَ ٱلَّذِينَ ٱشْتَرَوُا۟ ٱلضَّلَٰلَةَ بِٱلْهُدَىٰ فَمَا رَبِحَت تِّجَٰرَتُهُمْ وَمَا كَانُوا۟ مُهْتَدِينَ","Urdu":" یہی وہ لوگ ہیں جنہوں نے ہدایت کے بدلے گمراہی خرید لی۔ پس ان کی تجارت نفع بخش نہ ہوئی اور وہ ہدایت پانے والے نہ ہو سکے۔","English":"These are they who have taken error in exchange for guidance; but their traffic has brought them no gain, nor are they rightly guided.","German":"Sie sind es, die Irregehen eingetauscht haben gegen Führung; doch brachte ihr Handel keinen Gewinn, noch sind sie rechtgeleitet.","Spanish":" Son los que han preferido el camino erróneo al agrado de Al-lah; pero su comercio no les ha reportado beneficio, ni están rectamente guiados.","French":"Voilà ceux qui ont troqué le droit chemin contre l’égarement ; mais ils n’ont tiré aucun profit de leur transaction, et ils ne sont pas non plus guidés.","UrduTS":"یہ وہ لوگ ہیں جنہوں نے ہدایت کو چھوڑ کر گمراہی کو اختیار کر لیا جس کا نتیجہ یہ ہوا کہ نہ تو انہیں دنیوی فائدہ پہنچا اور نہ انہوں نے ہدایت پائی۔ ","a":17,"s":2}
{"index":{"_id":25}}
{"Surah":"سورة البَقَرَة","ayah":"2:18","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"مَثَلُهُمْ كَمَثَلِ ٱلَّذِى ٱسْتَوْقَدَ نَارًا فَلَمَّآ أَضَآءَتْ مَا حَوْلَهُۥ ذَهَبَ ٱللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِى ظُلُمَٰتٍ لَّا يُبْصِرُونَ","Urdu":"ان کی مثال اس شخص کی حالت کی مانند ہے جس نے آگ بھڑکائی۔ پس جب اس (آگ) نے اس کے ماحول کو روشن کر دیا، اللہ اُن (بھڑکانے والوں) کا نور لے گیا اور انہیں اندھیروں میں چھوڑ دیا کہ وہ کچھ دیکھ نہیں سکتے تھے۔","English":"Their case is like the case of a person who kindled a fire, and when it lighted up all around him, Allah took away their light and left them in thick darkness; they see not.","German":"Sie sind jenem Manne vergleichbar, der ein Feuer anzündete; und als es alles um ihn erhellte, nahm Allah ihr Licht hinweg und ließ sie in Finsternissen; sie sehen nicht.","Spanish":" Les ocurre como a la persona que encendió un fuego, y cuando lo iluminaba todo a su alrededor, Al-lah se llevó la luz y le dejó en la más negra oscuridad;<em> así</em> no pueden ver.","French":"Leur cas est semblable à celui de quelqu’un qui alluma un feu, et lorsque ceci éclaira tout autour de lui, Allāh enleva leur lumière et les laissa dans l’obscurité complète ! Ils ne voient rien.","UrduTS":"ان کی حالت اس شخص کی حالت کی طرح ہے جس نے آگ جلائی پھر جب اس (آگ) نے اس کے ارد گرد (کے علاقہ) کو روشن کر دیا تو اللہ ان کی روشنی کو لے گیا اور اس نے انہیں (قسم قسم کے) اندھیروں میں (اس حال میں) چھوڑ دیا (کہ) وہ (کوئی راہ نجات) نہیں دیکھتے۔ ","a":18,"s":2}
{"index":{"_id":26}}
{"Surah":"سورة البَقَرَة","ayah":"2:19","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"صُمٌّۢ بُكْمٌ عُمْىٌ فَهُمْ لَا يَرْجِعُونَ","Urdu":"وہ بہرے ہیں، وہ گونگے ہیں، وہ اندھے ہیں۔ پس وہ (ہدایت کی طرف) نہیں لوٹیں گے۔","English":"<i>They are</i> deaf, dumb <i>and</i> blind; so they will not return.","German":"Taub, stumm, blind: also werden sie nicht zurückkehren.","Spanish":" <em>Son</em> sordos, mudos y ciegos; por eso no volverán.","French":"<em>Ils sont</em> sourds, muets <em>et</em> aveugles ; aussi, ne retourneront-ils pas.","UrduTS":"وہ بہرے ہیں گونگے ہیں اندھے ہیں پس وہ لوٹیں گے نہیں۔ ","a":19,"s":2}
{"index":{"_id":27}}
{"Surah":"سورة البَقَرَة","ayah":"2:20","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"أَوْ كَصَيِّبٍ مِّنَ ٱلسَّمَآءِ فِيهِ ظُلُمَٰتٌ وَرَعْدٌ وَبَرْقٌ يَجْعَلُونَ أَصَٰبِعَهُمْ فِىٓ ءَاذَانِهِم مِّنَ ٱلصَّوَٰعِقِ حَذَرَ ٱلْمَوْتِ ۚ وَٱللَّهُ مُحِيطٌۢ بِٱلْكَٰفِرِينَ","Urdu":"یا (ان کی مثال) اس بارش کی سی ہے جو آسمان سے اُترتی ہے۔ اس میں اندھیرے بھی ہیں اور کڑک بھی اور بجلی بھی۔ وہ بجلی کے کڑکوں کی وجہ سے، موت کے ڈر سے اپنی انگلیاں اپنے کانوں میں ڈال لیتے ہیں۔ اور اللہ کافروں کو گھیرے میں لئے ہوئے ہے۔","English":"Or <i>it is</i> like a heavy rain from the clouds, wherein is thick darkness and thunder and lightning; they put their fingers into their ears because of the thunderclaps for fear of death, and Allah encompasses the disbelievers.","German":"Oder: wie schwerer Wolkenregen, worin Finsternisse und Donner und Blitz; sie stecken ihre Finger in die Ohren, in Todesfurcht vor den Donnerschlägen, während Allah die Ungläubigen umringt.","Spanish":" O <em>es</em> como un fuerte chaparrón que cae de las nubes, con oscuras tinieblas, truenos y relámpagos; se introducen los dedos en los oídos, a causa de los truenos y por temor a la muerte; y Al-lah pone un cerco alrededor de los incrédulos.","French":"Où <em>c’est</em> comme une pluie diluvienne, provenant de nuages, dans laquelle règnent des ténèbres, du tonnerre et des éclairs. Ils se bouchent les oreilles avec les doigts à cause du tonnerre par crainte de mourir ; et Allāh cerne les mécréants.","UrduTS":"یا (ان کا حال) اس بارش کی طرح ہے جو (گھٹا ٹوپ) بادل سے (برس رہی) ہو (ایسی بارش) جس کے ساتھ (قسم قسم کے) اندھیرے اور گرج اور بجلی ہوتی ہے‘ وہ اپنی انگلیوں کو کڑک کی وجہ سے موت کے ڈر سے کانوں میں ڈال لیتے ہیں حالانکہ اللہ تمام کافروں کو تباہ کرنے والا ہے۔ ","a":20,"s":2}
{"index":{"_id":28}}
{"Surah":"سورة البَقَرَة","ayah":"2:21","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Ruku_sw":3,"Ruku_sw_per_Juz":3,"Juz":1,"Manzil":1,"Ruku":3,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"يَكَادُ ٱلْبَرْقُ يَخْطَفُ أَبْصَٰرَهُمْ ۖ كُلَّمَآ أَضَآءَ لَهُم مَّشَوْا۟ فِيهِ وَإِذَآ أَظْلَمَ عَلَيْهِمْ قَامُوا۟ ۚ وَلَوْ شَآءَ ٱللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَٰرِهِمْ ۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ","Urdu":"قریب ہے کہ بجلی ان کی بینائی اچک لے۔ جب کبھی وہ اُن (کو راہ دکھانے) کے لئے چمکتی ہے وہ اس میں (کچھ) چلتے ہیں۔ اور جب وہ ان پر اندھیرا کر دیتی ہے تو ٹھہر جاتے ہیں۔ اور اگر اللہ چاہے تو ان کی شنوائی بھی لے جائے اور ان کی بینائی بھی۔ یقینا اللہ ہر چیز پر جسے وہ چاہے دائمی قدرت رکھتا ہے۔","English":"The lightning might well-nigh snatch away their sight; whenever it shines upon them, they walk therein; and when it becomes dark to them, they stand still. And if Allah willed, He could take away their hearing and their sight; surely, Allah has the power to do all that He wills.","German":"Der Blitz benimmt ihnen fast das Augenlicht; wann immer er auf sie zündet, wandeln sie darin, und wenn es über ihnen dunkel wird, stehen sie still. Und wäre es Allahs Wille, Er hätte ihr Gehör und ihr Gesicht fortgenommen. Allah hat die Macht, alles zu tun, was Er will.","Spanish":" Los relámpagos casi les dejan ciegos: Cuando brillan ante ellos, caminan a su luz; y cuando queda todo oscuro a su alrededor se detienen. Y si Al-lah quisiera, podría dejarlos sin oído y sin vista; ciertamente, Al-lah tiene poder para hacer todo lo que quiera.","French":"L’éclair pourrait presque leur dérober la vue ; chaque fois qu’il leur donne de l’éclairage, ils y marchent, mais dès qu’il fait obscur pour eux, ils s’immobilisent. Si Allāh le voulait, Il pourrait leur ôter l’ouïe et la vue. En vérité, Allāh a le pouvoir de faire tout ce qu’Il veut.","UrduTS":"قریب ہے کہ بجلی ان کی بینائی کو اچک کر لے جائے۔ جب بھی وہ ان پر چمکتی ہے تو وہ اس (کی روشنی) میں چلنے لگتے ہیں اور جب ان پر اندھیرا کر دیتی ہے تو کھڑے ہو جاتے ہیں اور اگر اللہ چاہتا تو یقیناً ان کی شنوائی اور ان کی بینائی کو ضائع کر دیتا اللہ ہر (اس) امر پر (جس کا وہ ارادہ کرے) یقیناً پوری طرح قادر ہے۔ ","a":21,"s":2}
{"index":{"_id":29}}
{"Surah":"سورة البَقَرَة","ayah":"2:22","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":4,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"يَٰٓأَيُّهَا ٱلنَّاسُ ٱعْبُدُوا۟ رَبَّكُمُ ٱلَّذِى خَلَقَكُمْ وَٱلَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ","Urdu":"اے لوگو! تم عبادت کرو اپنے رب کی جس نے تمہیں پیدا کیا اور ان کو بھی جو تم سے پہلے تھے۔ تا کہ تم تقویٰ اختیار کرو۔","English":"O ye men, worship your Lord Who created you and those who were before you, that you may become righteous;","German":"O ihr Menschen, dienet eurem Herrn, Der euch erschuf und die, die vor euch waren, auf dass ihr beschirmt seid;","Spanish":" ¡Oh hombres! adorad a vuestro Señor que os ha creado a vosotros y a vuestros antepasados para que lleguéis a ser piadosos.","French":"Ô hommes ! Adorez votre Seigneur Qui vous a créés, <em>vous</em> et ceux qui étaient avant vous, afin que vous agissiez avec droiture ;","UrduTS":"اے لوگو! اپنے (اس) رب کی عبادت کرو جس نے تمہیں (بھی) اور انہیں (بھی) جو تم سے پہلے گزرے ہیں پیدا کیا ہے تا کہ تم (ہر قسم کی آفات سے) بچو۔ ","a":22,"s":2}
{"index":{"_id":30}}
{"Surah":"سورة البَقَرَة","ayah":"2:23","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":4,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ فِرَٰشًا وَٱلسَّمَآءَ بِنَآءً وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءً فَأَخْرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزْقًا لَّكُمْ ۖ فَلَا تَجْعَلُوا۟ لِلَّهِ أَندَادًا وَأَنتُمْ تَعْلَمُونَ","Urdu":"جس نے زمین کو تمہارے لئے بچھونا اور آسمان کو (تمہاری بقا کی) بنیاد بنایا اور آسمان سے پانی اُتارا اور اس کے ذریعہ ہر طرح کے پھل تمہارے لئے بطور رزق نکالے۔ پس جانتے بوجھتے ہوئے اللہ کے شریک نہ بناﺅ۔","English":"Who made the earth a bed for you, and the heaven a roof, and caused water to come down from the clouds and therewith brought forth fruits for your sustenance. Set not up, therefore, equals to Allah, while you know.","German":"der die Erde gemacht hat zu einem Bette für euch, und den Himmel zu einem Dach, und Wasser hat niederregnen lassen von den Wolken und damit Früchte für euren Unterhalt hervorgebracht hat. Stellt Allah daher keine Götter zur Seite, denn ihr wisst es doch.","Spanish":" Que convirtió la tierra en lecho para vosotros y los cielos en techo, e hizo que cayera agua de las nubes y de ese modo hizo crecer frutos para vuestro sustento. No pongáis pues a nadie a la altura de Al-lah puesto que ya sabéis.","French":"Qui a fait la terre un lit pour vous, et le ciel un toit, Qui a fait que l’eau descende des nuages, et par cela a produit des fruits pour votre subsistance. Ne donnez pas d’égaux à Allāh, puisque vous savez.","UrduTS":"(وہی ہے) جس نے تمہارے لئے زمین کو بچھونے اور آسمان کو چھت کے طور پر بنایا ہے اور بادلوں سے پانی اتارا ہے‘ پھر اس (پانی) کے ذریعہ سے میووں کی قسم کا رزق تمہارے لئے نکالا ہے۔ پس تم سمجھتے بوجھتے ہوئے اللہ کے ہمسر نہ بناٶ۔ ","a":23,"s":2}
{"index":{"_id":31}}
{"Surah":"سورة البَقَرَة","ayah":"2:24","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":4,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِن كُنتُمْ فِى رَيْبٍ مِّمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا فَأْتُوا۟ بِسُورَةٍ مِّن مِّثْلِهِۦ وَٱدْعُوا۟ شُهَدَآءَكُم مِّن دُونِ ٱللَّهِ إِن كُنتُمْ صَٰدِقِينَ","Urdu":"اور اگر تم اس بارے میں شک میں ہو جو ہم نے اپنے بندے پر اتارا ہے تو اس جیسی کوئی سُورت تو لا کے دکھاﺅ، اور اپنے سرپرستوں کو بھی بلا لاﺅ جو اللہ کے سوا (تم نے بنارکھے) ہیں، اگر تم سچے ہو۔","English":"And if you are in doubt as to what We have sent down to Our servant, then produce a Chapter like it, and call upon your helpers beside Allah, if you are truthful.","German":"Und wenn ihr im Zweifel seid über das, was Wir hinabgesandt haben zu Unserem Diener, dann bringt eine Sura hervor wie diesen (Qur-ân) und ruft eure Helfer auf außer Allah, wenn ihr wahrhaftig seid.","Spanish":" Y si dudáis sobre lo que hemos revelado a Nuestro siervo, entonces presentad un capítulo como éste, y llamad a quienes os ayudan, prescindiendo de Al-lah, si es que sois veraces.","French":"Et si vous mettez en doute ce que Nous avons fait descendre sur Notre serviteur, alors produisez une sourate similaire, et invoquez vos <em>divinités</em> – aides en dehors d’Allāh, si vous dites la vérité.","UrduTS":"اور اگر اس (کلام) کے سبب سے جو ہم نے اپنے بندے پر اتارا ہے تم کسی (قسم کے) شک میں (مبتلا ہو گئے) ہو تو اگر تم سچے ہو تو اس جیسی ایک سورۃ لے آٶ اور اپنے غیر اللہ مددگاروں کو (بھی اپنی مدد کے لئے) بلالو۔ ","a":24,"s":2}
{"index":{"_id":32}}
{"Surah":"سورة البَقَرَة","ayah":"2:25","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":4,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"فَإِن لَّمْ تَفْعَلُوا۟ وَلَن تَفْعَلُوا۟ فَٱتَّقُوا۟ ٱلنَّارَ ٱلَّتِى وَقُودُهَا ٱلنَّاسُ وَٱلْحِجَارَةُ ۖ أُعِدَّتْ لِلْكَٰفِرِينَ","Urdu":"پس اگر تم ایسا نہ کر سکو اور ہرگز نہ کر سکوگے تو اس آگ سے ڈرو جس کا ایندھن انسان اور پتھر ہیں۔ وہ کافروں کے لئے تیار کی گئی ہے۔","English":"But if you do <i>it</i> not  —  and never shall you do <i>it</i>  —  then guard against the Fire, whose fuel is men and stones, <i>which is</i> prepared for the disbelievers.","German":"Doch wenn ihr es nicht tut – und nie werdet ihr es vermögen –, dann hütet euch vor dem Feuer, dessen Nahrung Menschen und Steine sind, bereitet für die Ungläubigen.","Spanish":" Pero si no <em>lo</em> hacéis – y nunca <em>lo </em>haréis – temed entonces al Fuego, cuyo combustible son hombres y piedras, <em>que está</em> preparado para los impíos.","French":"Mais si vous ne <em>le</em> faites pas – et jamais vous ne <em>le</em> ferez – alors craignez le feu dont le combustible est fait d’hommes et de pierres <em>et qui est</em> préparé pour les mécréants.","UrduTS":"اور اگر تم نے ایسا نہ کیا اور تم ہرگز (ایسا) نہ کر سکو گے تو اس آگ سے بچو جس کا ایندھن آدمی اور پتھر ہیں۔ وہ کافروں کے لئے تیارکی گئی ہے۔ ","a":25,"s":2}
{"index":{"_id":33}}
{"Surah":"سورة البَقَرَة","ayah":"2:26","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":4,"Hisb":1,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَبَشِّرِ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمْ جَنَّٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ ۖ كُلَّمَا رُزِقُوا۟ مِنْهَا مِن ثَمَرَةٍ رِّزْقًا ۙ قَالُوا۟ هَٰذَا ٱلَّذِى رُزِقْنَا مِن قَبْلُ ۖ وَأُتُوا۟ بِهِۦ مُتَشَٰبِهًا ۖ وَلَهُمْ فِيهَآ أَزْوَٰجٌ مُّطَهَّرَةٌ ۖ وَهُمْ فِيهَا خَٰلِدُونَ","Urdu":"اور خوشخبری دے دے ان لوگوں کو جو ایمان لائے اور نیک اعمال بجا لائے کہ ان کے لئے ایسے باغات ہیں جن کے دامن میں نہریں بہتی ہیں۔ جب بھی وہ اُن (باغات) میں سے کوئی پھل بطور رزق دیئے جائیں گے تو وہ کہیں گے یہ تو وہی ہے جو ہمیں پہلے بھی دیا جا چکا ہے۔ حالانکہ اس سے پہلے ان کے پاس محض اس سے ملتا جلتا(رزق) لایا گیا تھا۔ اور ان کے لئے ان (باغات) میں پاک بنائے ہوئے جوڑے ہوں گے۔ اور وہ ان میں ہمیشہ رہنے والے ہیں۔","English":"And give glad tidings to those who believe and do good works, that for them are Gardens beneath which flow streams. Whenever they are given a portion of fruit therefrom, they will say: ‘This is what was given us before,’ and gifts mutually resembling shall be brought to them. And they will have therein mates perfectly pure, and therein will they abide.","German":"Und bringe frohe Botschaft denen, die glauben und gute Werke tun, dass Gärten für sie sind, durch die Ströme fließen. Wann immer ihnen von den Früchten daraus gegeben wird, werden sie sprechen: \"Das ist, was uns zuvor gegeben wurde\", und (Gaben) gleicher Art sollen ihnen gebracht werden. Und sie werden darin Gefährten und Gefährtinnen haben von vollkommener Reinheit, und darin werden sie weilen.","Spanish":" Y anuncia la buena nueva a los que creen y hacen buenas obras, que para ellos hay jardines bajo los cuales corren arroyos. Cada vez que reciban los frutos producidos en ellos dirán: “Esto es lo que se nos había dado antes”, aunque solo se les entregarán dones similares. Y tendrán allí parejas, totalmente puras; y allí pondrán su morada.","French":"Et annonce à ceux qui croient et font de bonnes œuvres, la bonne nouvelle qu’il y a pour eux des Jardins sous lesquels coulent des ruisseaux. Chaque fois qu’ils en recevront une portion de fruits, ils diront : « Voici ce qui nous a été accordé auparavant en guise de provision » ; alors que ce qui leur a été donné <em>auparavant</em> n’a qu’une ressemblance avec ceci. Ils y auront des conjoints/es purifiés/es <em>par Nous</em> et ils y demeureront éternellement.","UrduTS":"اور تو ان  لوگوں کو جو ایمان لائے ہیں اور انہوں نے نیک عمل کیے ہیں خوشخبری دے کہ ان کے لئے (ایسے) باغ ہیں جن کے نیچے نہریں بہتی ہیں۔ جب بھی ان (باغوں) کے پھل میں سے کچھ رزق انہیں دیا جائے گا‘ وہ کہیں گے یہ تو وہی (رزق) ہے جو ہمیں اس سے پہلے دیا گیا تھا اور ان کے پاس وہ (رزق) ملتا جلتا لایا جائے گا اور ان کے لئے ان (باغوں) میں پاک جوڑے ہونگے اور وہ ان (باغوں) کے اندر (ہمیشہ) بسیں گے۔ ","a":26,"s":2}
{"index":{"_id":34}}
{"Surah":"سورة البَقَرَة","ayah":"2:27","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","hisQ_sw":2,"Juz":1,"Manzil":1,"Ruku":4,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"۞ إِنَّ ٱللَّهَ لَا يَسْتَحْىِۦٓ أَن يَضْرِبَ مَثَلًا مَّا بَعُوضَةً فَمَا فَوْقَهَا ۚ فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ فَيَعْلَمُونَ أَنَّهُ ٱلْحَقُّ مِن رَّبِّهِمْ ۖ وَأَمَّا ٱلَّذِينَ كَفَرُوا۟ فَيَقُولُونَ مَاذَآ أَرَادَ ٱللَّهُ بِهَٰذَا مَثَلًا ۘ يُضِلُّ بِهِۦ كَثِيرًا وَيَهْدِى بِهِۦ كَثِيرًا ۚ وَمَا يُضِلُّ بِهِۦٓ إِلَّا ٱلْفَٰسِقِينَ","Urdu":" اللہ ہرگز اس سے نہیں شرماتا کہ کوئی سی مثال پیش کرے جیسے مچھر کی بلکہ اُس کی بھی جو اُس کے اوپر ہے۔ پس جہاں تک ان لوگوں کا تعلق ہے جو ایمان لائے تو وہ جانتے ہیں کہ یہ ان کے ربّ کی طرف سے حق ہے۔ اور جہاں تک ان لوگوں کا تعلق ہے جنہوں نے انکار کیا تو وہ کہتے ہیں (آخر) یہ مثال پیش کرنے سے اللہ کا مقصد کیا ہے۔ وہ اس (مثال) کے ذریعہ سے بہتوں کو گمراہ ٹھہراتا ہے اور بہتوں کو اس کے ذریعہ سے ہدایت دیتا ہے اور وہ اس کے ذریعہ فاسقوں کے سوا کسی کو گمراہ نہیں ٹھہراتا۔","English":"Allah disdains not to give an illustration as small as a gnat or even smaller. Those who believe know that it is the truth from their Lord, while those who disbelieve say: ‘What does Allah mean by such an illustration?’ Many does He adjudge by it to be erring and many by it does He guide, and none does He adjudge thereby to be erring except the disobedient,","German":"Allah verschmäht nicht, über ein Ding zu sprechen, das klein ist wie eine Mücke oder gar noch kleiner. Die da glauben, wissen, dass es die Wahrheit von ihrem Herrn ist, dieweil die Ungläubigen sprechen: \"Was meint Allah mit solcher Rede?\" Damit erklärt Er viele zu Irrenden, und vielen weist Er damit den Weg","Spanish":" Al-lah no se avergüenza de usar como parábola un mosquito o incluso algo más pequeño. Los que creen saben que ésa es la verdad que viene de su Señor, mientras que los descreídos dicen: “¿Qué pretende Al-lah con esta parábola?”. Con ella juzga a muchos como extraviados y a otros muchos los guía, pero a nadie juzga como descarriados, excepto a los desobedientes,","French":"En vérité, Allāh ne dédaigne pas de citer en exemple même un moustique et même ce qui est sur lui <em>comme charge</em>. Ceux qui croient savent que c’est la vérité de leur Seigneur, tandis que les mécréants demandent : « Que veut dire Allāh par un tel exemple ? » Nombreux sont ceux qu’Il juge ainsi comme étant égarés et nombreux aussi sont ceux qu’Il guide ; et Il ne juge comme étant égarés que les désobéissants,","UrduTS":"اللہ ہرگز نہیں رکتا کسی بات کے بیان کرنے سے خواہ وہ مچھر کے برابر ہو یا اس سے بھی بڑھ کر۔ پھر جو لوگ ایمان رکھتے ہیں وہ (تو) جان لیتے ہیں کہ وہ ان کے رب کی طرف سے بالکل حق (بات) ہے اور جو لوگ کافر ہوئے وہ کہتے ہیں کہ (آخر) اللہ کا اس بات کے بیان کرنے سے منشا کیا ہے؟ (اصل بات یہ ہے کہ) وہ بہت (سے لوگوں) کو اس (قرآن) کے ذریعہ سے گمراہ قرار دیتا ہے اور بہت (سے لوگوں) کو اس (قرآن) کے ذریعہ سے ہدایت دیتا ہے اور وہ اس کے ذریعہ سے ان نافرمانوں کے سوا کسی کو گمراہ قرار نہیں دیتا۔ ","a":27,"s":2}
{"index":{"_id":35}}
{"Surah":"سورة البَقَرَة","ayah":"2:28","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":4,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ٱلَّذِينَ يَنقُضُونَ عَهْدَ ٱللَّهِ مِنۢ بَعْدِ مِيثَٰقِهِۦ وَيَقْطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفْسِدُونَ فِى ٱلْأَرْضِ ۚ أُو۟لَٰٓئِكَ هُمُ ٱلْخَٰسِرُونَ","Urdu":"یعنی وہ لوگ جو اللہ کے عہد کو اسے مضبوطی سے باندھنے کے بعد توڑ دیتے ہیں اور ان (تعلقات) کو کاٹ دیتے ہیں جن کو جوڑنے کا اللہ نے حکم دیا ہے اور زمین میں فساد کرتے ہیں ۔ یہی وہ لوگ ہیں جو گھاٹا پانے والے ہیں۔ ","English":"Who break the covenant of Allah after having established it, and cut asunder what Allah has bidden to be joined, and create disorder in the earth; it is these that are the losers.","German":"die den Bund Allahs brechen, nach seiner Errichtung, und zerschneiden, was Allah zu verbinden gebot, und Unfrieden auf Erden stiften: diese sind die Verlierenden.","Spanish":" Quienes rompen el pacto con Al-lah después de haberlo aceptado, y separan con ello lo que Al-lah ha ordenado que se mantenga unido, y crean el desorden en la tierra; ellos son los perdedores.","French":"Qui brisent le pacte d’Allāh après l’avoir établi, qui tranchent <em>les liens</em> qu’Allāh a ordonné d’unir, et qui créent le désordre sur la terre ; ceux-là sont les perdants.","UrduTS":"جو اللہ کے عہد کو اس کے پختہ کرنے کے بعد توڑ دیتے ہیں اور اس چیز کو جسے ملانے کا اللہ نے حکم دیا ہے کاٹتے ہیں اور زمین میں فساد کرتے ہیں‘ وہی لوگ نقصان اٹھانے والے ہیں۔ ","a":28,"s":2}
{"index":{"_id":36}}
{"Surah":"سورة البَقَرَة","ayah":"2:29","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":4,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"كَيْفَ تَكْفُرُونَ بِٱللَّهِ وَكُنتُمْ أَمْوَٰتًا فَأَحْيَٰكُمْ ۖ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ثُمَّ إِلَيْهِ تُرْجَعُونَ","Urdu":"تم کس طرح اللہ کا انکار کرتے ہو جبکہ تم مُردہ تھے پھر اس نے تمہیں زندہ کیا۔ وہ پھر تمہیں مارے گا اور پھر تمہیں زندہ کرے گا۔ پھر اسی کی طرف تم لوٹائے جاﺅ گے۔","English":"How can you disbelieve in Allah? When you were without life, He gave you life, and then He will cause you to die, then restore you to life, and then to Him shall you be made to return.","German":"Wie könnt ihr Allah verleugnen? Ihr waret doch ohne Leben, und Er gab euch Leben, und dann wird Er euch sterben lassen, dann euch dem Leben wiedergeben, und ihr kehrt dann zu Ihm zurück.","Spanish":" ¿Cómo podéis no creer en Al-lah? Cuando no teníais vida Él os dio la vida, y después os hará morir y os devolverá de nuevo la vida, y más tarde a Él seréis restituidos.","French":"Comment pouvez-vous ne pas croire en Allāh ? Vous étiez sans vie et Il vous a donné la vie. Ensuite, Il vous fera mourir, puis Il vous rendra la vie, et alors vous serez ramenés à Lui.","UrduTS":"(اے لوگو)! تم کس طرح اللہ (کی باتوں) کا انکار کرتے ہو؟ حالانکہ تم بے جان تھے۔ پھر اس نے تمہیں جان دار بنایا‘ پھر (ایک دن آئے گا کہ) وہ تمہیں مارے گا پھر تمہیں زندہ کرے گا جس کے بعد تمہیں اس کی طرف لوٹایا جائے گا۔ ","a":29,"s":2}
{"index":{"_id":37}}
{"Surah":"سورة البَقَرَة","ayah":"2:30","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Ruku_sw":4,"Ruku_sw_per_Juz":4,"Juz":1,"Manzil":1,"Ruku":4,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"هُوَ ٱلَّذِى خَلَقَ لَكُم مَّا فِى ٱلْأَرْضِ جَمِيعًا ثُمَّ ٱسْتَوَىٰٓ إِلَى ٱلسَّمَآءِ فَسَوَّىٰهُنَّ سَبْعَ سَمَٰوَٰتٍ ۚ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌ","Urdu":"وہی تو ہے جس نے تمہارے لئے وہ سب کا سب پیدا کیا جو زمین میں ہے۔ پھر وہ آسمان کی طرف متوجہ ہوا اور اسے سات آسمانوں کی صورت میں متوازن کردیا اور وہ ہرچیز کا دائمی علم رکھنے والا ہے۔","English":"He it is Who created for you all that is in the earth; then He turned towards the heavens, and He perfected them as seven heavens; and He knows all things.","German":"Er ist es, Der alles für euch erschuf, was auf Erden ist; dann wandte Er Sich nach dem Himmel; Er vollendete deren sieben Himmel, und Er weiß alle Dinge wohl.","Spanish":" Él es quien creó para vosotros todo lo que hay en la tierra; después se volvió al Cielo y lo dispuso en siete cielos; y Él sabe todas las cosas.","French":"C’est Lui Qui a créé pour vous tout ce qui est sur terre ; puis Il S’est tourné vers les cieux. Il les a parfaits en en <em>formant</em> sept et Il est Omniscient.","UrduTS":"وہ (خدا) وہی (تو) ہے جس نے ان تمام چیزوں کو جو زمین میں ہیں تمہارے (فائدہ کے) لئے پیدا کیا۔ پھر وہ آسمانوں کی طرف متوجہ ہوا اور انہیں مکمل بنا دیا سات آسمان‘ اور وہ ہر ایک بات (کی حقیقت) کو خوب جانتا ہے۔ ","a":30,"s":2}
{"index":{"_id":38}}
{"Surah":"سورة البَقَرَة","ayah":"2:31","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":5,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ قَالَ رَبُّكَ لِلْمَلَٰٓئِكَةِ إِنِّى جَاعِلٌ فِى ٱلْأَرْضِ خَلِيفَةً ۖ قَالُوٓا۟ أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ ٱلدِّمَآءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ ۖ قَالَ إِنِّىٓ أَعْلَمُ مَا لَا تَعْلَمُونَ","Urdu":"اور (یاد رکھ) جب تیرے ربّ نے فرشتوں سے کہا کہ یقیناً میں زمین میں ایک خلیفہ بنانے والا ہوں۔ انہوں نے کہا کیا تُو اُس میں وہ بنائے گا جو اُس میں فساد کرے اور خون بہائے جبکہ ہم تیری حمد کے ساتھ تسبیح کرتے ہیں اور ہم تیری پاکیزگی بیان کرتے ہیں۔ اُس نے کہا یقیناً میں وہ سب کچھ جانتا ہوں جو تم نہیں جانتے۔ ","English":"And when thy Lord said to the angels: ‘I am about to place a vicegerent in the earth,’ they said: ‘Wilt Thou place therein such as will cause disorder in it, and shed blood?  —  and we glorify Thee with Thy praise and extol Thy holiness.’ He answered: ‘I know what you know not.’","German":"Und als dein Herr zu den Engeln sprach: \"Ich will einen Statthalter auf Erden einsetzen\", sagten sie: \"Willst Du denn dort solche Wesen haben, die darauf Unfrieden stiften und Blut vergießen? – und wir loben und preisen Dich und rühmen Deine Heiligkeit.\" Er antwortete: \"Ich weiß, was ihr nicht wisst.\"","Spanish":" Y cuando tu Señor dijo a los ángeles: “Estoy a punto de designar un vicario en la tierra,” dijeron: “¿Vas a situar en ella a quien cree el desorden y derrame la sangre? y nosotros Te glorificamos con Tus alabanzas y exaltamos Tu santidad”. Él respondió: “Yo sé lo que vosotros no sabéis.”","French":"Et lorsque ton Seigneur dit aux anges : « Je vais nommer un représentant sur la terre, » ils <em>Lui</em> dirent : « Vas-Tu y placer quelqu’un susceptible d’y créer le désordre et d’<em>y</em> répandre le sang ? – alors que nous Te glorifions par <em>Tes</em> louanges et que nous exaltons Ta Sainteté. » Il <em>leur</em> répondit : « Certainement Je sais ce que vous ne savez pas. »","UrduTS":"اور (اے انسان! تو اس وقت کو یاد کر) جب تیرے رب نے ملائکہ سے کہا کہ میں زمین میں ایک خلیفہ بنانے والا ہوں (اس پر) انہوں نے کہا کہ کیا تو اس میں (ایسے شخص بھی) پیدا کرے گا جو اس میں فساد کریں گے اور خون بہائیں گے اور ہم (تو وہ ہیں جو) تیری حمد کے ساتھ (ساتھ) تیری تسبیح (بھی) کرتے ہیں اور تجھ میں سب بڑائیوں کے پائے جانے کا اقرار کرتے ہیں (اس پر اللہ نے) فرمایا میں یقیناً وہ کچھ جانتا ہوں جو تم نہیں جانتے۔ ","a":31,"s":2}
{"index":{"_id":39}}
{"Surah":"سورة البَقَرَة","ayah":"2:32","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":5,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَعَلَّمَ ءَادَمَ ٱلْأَسْمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمْ عَلَى ٱلْمَلَٰٓئِكَةِ فَقَالَ أَنۢبِـُٔونِى بِأَسْمَآءِ هَٰٓؤُلَآءِ إِن كُنتُمْ صَٰدِقِينَ","Urdu":"اور اس نے آدم کو تمام نام سکھائے پھر ان (مخلوقات) کو فرشتوں کے سامنے پیش کیا اور کہا مجھے ان کے نام بتلاﺅ اگر تم سچے ہو۔","English":"And He taught Adam all the names, then He put <i>the objects of</i> these <i>names</i> before the angels and said: ‘Tell Me the names of these, if you are right.’","German":"Und Er lehrte Adam alle Namen*; dann stellte Er (die Benannten) vor die Engel hin und sprach: \"Nennt Mir ihre Namen, wenn ihr im Recht seid.\"","Spanish":" Y enseñó a Adán todos los nombres, y acto seguido puso <em>los objetos de</em> estos <em>nombres</em> ante los ángeles y dijo: “Decidme sus nombres, si sois veraces”.","French":"Et Il enseigna à Adam tous les noms, puis présenta aux anges les <em> objets correspondants</em>, <em>en leur</em> disant : « Si vous êtes dans le vrai, dites-Moi les noms de ces <em>objets</em>. »","UrduTS":"اور (اللہ نے) آدم کو سب نام سکھائے پھر (جن کے وہ نام تھے) ان کو ملائکہ کے سامنے پیش کرکے فرمایا کہ اگر تم درست بات کہہ رہے ہو تو تم مجھے ان کے نام بتاٶ۔ ","a":32,"s":2}
{"index":{"_id":40}}
{"Surah":"سورة البَقَرَة","ayah":"2:33","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":5,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"قَالُوا۟ سُبْحَٰنَكَ لَا عِلْمَ لَنَآ إِلَّا مَا عَلَّمْتَنَآ ۖ إِنَّكَ أَنتَ ٱلْعَلِيمُ ٱلْحَكِيمُ","Urdu":"انہوں نے کہا پاک ہے تُو۔ ہمیں کسی بات کا کچھ علم نہیں سوائے اُس کے جس کا تُو ہمیں علم دے۔ یقیناً تُو ہی ہے جو دائمی علم رکھنے والا (اور) بہت حکمت والا ہے۔ ","English":"They said: ‘Holy art Thou! No knowledge have we except what Thou hast taught us; surely, Thou art the All-Knowing, the Wise.’","German":"Sie sprachen: \"Heilig bist Du! Wir haben kein Wissen außer dem, was Du uns gelehrt hast; wahrlich, Du allein bist der Allwissende, der Allweise.\"","Spanish":" Ellos dijeron: “¡Santo eres! No sabemos nada, excepto lo que Tú nos has enseñado; ciertamente, Tú eres el Omnisciente, el Sabio”.","French":"Ils répondirent : « Gloire à Toi ! Nous ne savons que ce que Tu nous as enseigné. En vérité, Tu es l’Omniscient, le Sage. »","UrduTS":"انہوں نے کہا تو بے عیب ہے جو (کچھ) تو نے ہمیں سکھایا ہے اس کے سوا ہمیں کسی قسم کا علم نہیں ہے یقیناً تو ہی کامل علم والا (اور ہر قول و فعل میں) حکمت کو مدنظر رکھنے والا ہے۔ ","a":33,"s":2}
{"index":{"_id":41}}
{"Surah":"سورة البَقَرَة","ayah":"2:34","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":5,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"قَالَ يَٰٓـَٔادَمُ أَنۢبِئْهُم بِأَسْمَآئِهِمْ ۖ فَلَمَّآ أَنۢبَأَهُم بِأَسْمَآئِهِمْ قَالَ أَلَمْ أَقُل لَّكُمْ إِنِّىٓ أَعْلَمُ غَيْبَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَأَعْلَمُ مَا تُبْدُونَ وَمَا كُنتُمْ تَكْتُمُونَ","Urdu":" اُس نے کہا اے آدم! تُو اِن کو اُن کے نام بتا۔ پس جب اُس نے اُنہیں اُن کے نام بتائے تو اُس نے کہا کیا میں نے تمہیں کہا نہیں تھا کہ یقیناً میں ہی آسمانوں اور زمین کے غیب کو جانتا ہوں اور میں وہ (بھی) جانتا ہوں جو تم ظاہر کرتے ہو اور وہ (بھی) جو تم چھپاتے ہو۔","English":"He said: ‘O Adam, tell them their names;’ and when he had told them their names, He said: ‘Did I not say to you, I know the secrets of the heavens and of the earth, and I know what you reveal and what you conceal?’","German":"Er sprach: \"O Adam, nenne ihnen ihre Namen\"; und als er ihnen ihre Namen genannt hatte, sprach Er: \"Habe Ich euch nicht gesagt: Ich weiß die Geheimnisse der Himmel und der Erde, und Ich weiß, was ihr offenbart und was ihr verhehlt?\"","Spanish":" Dijo: “Oh Adán, diles sus nombres”; y cuando les hubo dicho los nombres, dijo: “¿No os he manifestado que conozco los secretos de los cielos y de la tierra, y sé lo que mostráis y lo que ocultáis?”","French":"Il dit : « Ô Adam, dis-leur les noms de ces <em>objets</em>. » Et lorsque Adam leur eut dit les noms des <em>objets</em>, <em>Allāh</em> dit <em>aux anges</em> : « Ne vous ai-Je pas dit que Je connais les secrets des cieux et de la terre et que Je sais <em>tout</em> ce que vous dévoilez et <em>tout</em> ce que vous dissimulez ? »","UrduTS":"(اس پر اللہ نے) فرمایا۔ اے آدم! ان فرشتوں کو ان کے نام بتا۔ پھر جب اس (یعنی آدم) نے ان کو ان کے نام بتائے (تو) فرمایا‘ کیا میں نے تمہیں نہیں کہا تھا کہ میں یقیناً آسمانوں اور زمین کی چھپی باتیں جانتا ہوں اور میں (اسے بھی) جانتا ہوں جو تم ظاہر کرتے ہو اور (اسے بھی) جو تم چھپاتے ہو۔ ","a":34,"s":2}
{"index":{"_id":42}}
{"Surah":"سورة البَقَرَة","ayah":"2:35","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":5,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ قُلْنَا لِلْمَلَٰٓئِكَةِ ٱسْجُدُوا۟ لِءَادَمَ فَسَجَدُوٓا۟ إِلَّآ إِبْلِيسَ أَبَىٰ وَٱسْتَكْبَرَ وَكَانَ مِنَ ٱلْكَٰفِرِينَ","Urdu":"اور جب ہم نے فرشتوں سے کہا کہ آدم کی خاطر سجدہ کرو تو وہ سب سجدہ ریز ہوگئے سوائے ابلیس کے۔ اس نے انکار کیا اور استکبار سے کام لیا اور وہ کافروں میں سے تھا۔","English":"And <i>remember the time</i> when We said to the angels: ‘Submit to Adam,’ and they <i>all</i> submitted. But Iblis <i>did not</i>. He refused and was too proud; and he was of the disbelievers.","German":"Und (gedenke der Zeit) da Wir zu den Engeln sprachen: \"Gehorchet Adam\", und sie alle gehorchten; nur Iblis* nicht. Er weigerte sich und war zu stolz, denn er war der Ungläubigen einer.","Spanish":" Y <em>recordad</em> cuando dijimos a los ángeles: “Someteos a Adán” y <em>todos </em>se sometieron excepto Iblis. Se negó y actuó con arrogancia; y fue uno de los incrédulos.","French":"Et <em>souvenez-vous</em> lorsque Nous avons dit aux anges : « Soumettez-vous à <em>l’autorité d’</em>Adam, » et <em>tous</em> ils se soumirent excepté Iblīs. Il refusa et fit preuve d’arrogance et il était du nombre des mécréants.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب ہم نے فرشتوں سے کہا کہ آدم کی فرمانبرداری کرو۔ اس پر انہوں نے تو فرمانبرداری کی مگر ابلیس (نے نہ کی اس) نے انکار کیا اور تکبر کیا اور وہ (پہلے سے ہی) کافروں میں سے تھا۔ ","a":35,"s":2}
{"index":{"_id":43}}
{"Surah":"سورة البَقَرَة","ayah":"2:36","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":5,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَقُلْنَا يَٰٓـَٔادَمُ ٱسْكُنْ أَنتَ وَزَوْجُكَ ٱلْجَنَّةَ وَكُلَا مِنْهَا رَغَدًا حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَٰذِهِ ٱلشَّجَرَةَ فَتَكُونَا مِنَ ٱلظَّٰلِمِينَ","Urdu":"اور ہم نے کہا اے آدم! تُو اور تیری زوجہ جنت میں سکونت اختیار کرو اور تم دونوں اس میں جہاں سے چاہو بافراغت کھاﺅ مگر اس مخصوص درخت کے قریب نہ جانا ورنہ تم دونوں ظالموں میں سے ہو جاﺅ گے۔","English":"And We said: ‘O Adam, dwell thou and thy wife in the garden, and eat therefrom plentifully wherever you will, but approach not this tree, lest you be of the wrongdoers.’","German":"Und Wir sprachen: \"O Adam, weile du und dein Weib in dem Garten, und esset reichlich von dem Seinigen, wo immer ihr wollt; nur nahet nicht diesem Baume, auf dass ihr nicht Frevler seiet.\"","Spanish":" Y dijimos: “Oh Adán, habitad tú y tu esposa en el jardín, y comed de él en abundancia en cualquier lugar que deseéis, pero no os acerquéis a este árbol, no sea que os convirtáis en transgresores.”","French":"Et Nous avons dit : « Ô Adam, demeure avec ta femme dans le jardin, consommez-y en abondance où vous voudrez. Mais n’approchez pas de cet arbre, pour que vous ne soyez pas du nombre des injustes. »","UrduTS":"اور ہم نے (آدم سے) کہا (کہ) اے آدم! تو اور تیری بیوی جنت میں رہو اور اس میں سے جہاں سے چاہو بافراغت کھاٶ‘ مگر اس (یعنی فلاں) درخت کے قریب نہ جانا۔ ورنہ تم ظالموں میں سے ہو جاٶ گے۔ ","a":36,"s":2}
{"index":{"_id":44}}
{"Surah":"سورة البَقَرَة","ayah":"2:37","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":5,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"فَأَزَلَّهُمَا ٱلشَّيْطَٰنُ عَنْهَا فَأَخْرَجَهُمَا مِمَّا كَانَا فِيهِ ۖ وَقُلْنَا ٱهْبِطُوا۟ بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۖ وَلَكُمْ فِى ٱلْأَرْضِ مُسْتَقَرٌّ وَمَتَٰعٌ إِلَىٰ حِينٍ","Urdu":"پس شیطان نے ان دونوں کو اس (درخت) کے معاملہ میں پھسلا دیا پس اُس سے انہیں نکال دیا جس میں وہ پہلے تھے ۔ اور ہم نے کہا تم نکل جاؤ (اس حال میں کہ) تم میں سے بعض بعض کے دشمن ہوں گے اور تمہارے لئے (اس) زمین میں ایک عرصہ تک قیام اور استفادہ (مقدر) ہے۔","English":"But Satan caused them both to slip by means of it and drove them out of <i>the state</i> in which they were. And We said: ‘Go forth; some of you are enemies of others, and for you there is an abode in the earth and a provision for a time.","German":"Doch Satan ließ beide daran straucheln und vertrieb sie von dort, worin sie waren. Und Wir sprachen: \"Gehet hinweg, einige von euch sind Feinde der anderen, und für euch ist eine Wohnstatt auf Erden und ein Nießbrauch für eine Weile.\"","Spanish":" Pero Satanás hizo, por su medio, que ambos cometieran un desliz y les expulsó del <em>estado</em> en que se encontraban. Y les dijimos: “Salid; algunos sois enemigos de otros, y para vosotros hay una morada en la tierra y provisiones durante algún tiempo.”","French":"Mais Satan les fit trébucher<em>en leur faisant négliger le commandement</em> à l’égard de l’ <em>arbre</em>, et les fit sortir de <em>l’état</em> où ils étaient. Alors, Nous <em>leur</em> avons dit : « Partez, les uns étant les ennemis des autres. Il y aura pour vous une demeure sur la terre et une provision pour un temps. »","UrduTS":"اور (اس کے بعد یوں ہوا کہ) شیطان نے اس (درخت) کے ذریعہ سے ان (دونوں) کو (ان کے مقام سے) ہٹا دیا اور (اس طرح) اس نے انہیں اس (حالت) سے جس میں وہ تھے نکال دیا اور ہم نے (انہیں) کہا (کہ یہاں سے) نکل جاٶ۔ تم میں سے بعض بعض کے دشمن ہیں اور (یاد رکھو کہ) تمہارے لئے ایک (مقررہ) وقت تک اسی زمین میں جائے رہائش اور سامان معیشت (مقدر) ہے۔ ","a":37,"s":2}
{"index":{"_id":45}}
{"Surah":"سورة البَقَرَة","ayah":"2:38","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":5,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"فَتَلَقَّىٰٓ ءَادَمُ مِن رَّبِّهِۦ كَلِمَٰتٍ فَتَابَ عَلَيْهِ ۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","Urdu":"پھر آدم نے اپنے ربّ سے کچھ کلمات سیکھے۔ پس وہ اس پر توبہ قبول کرتے ہوئے جُھکا ۔ یقیناً وہی بہت توبہ قبول کرنے والا (اور) بار بار رحم کرنے والا ہے۔","English":"Then Adam learnt from his Lord certain words <i>of prayer</i>. So He turned towards him with mercy. Surely, He is Oft-Returning <i>with compassion, and is</i> Merciful.","German":"Dann empfing Adam von seinem Herrn gewisse Worte (des Gebets). So kehrte Er Sich gnädig zu ihm; wahrlich, Er ist der oft gnädig Sich Wendende, der Barmherzige.","Spanish":" Y Adán aprendió de su Señor ciertas palabras <em>de oración. </em>Y de ese modo Él volvió a <em>mirarlo</em> con misericordia. En verdad, Él es Remisorio <em>con compasión</em>, <em>y es </em>Misericordioso.","French":"Ensuite, Adam apprit par son Seigneur certains mots <em>de prière</em>. Ainsi, Il s’est tourné vers lui avec clémence, car Il est Celui Qui revient sans cesse avec compassion, le Miséricordieux.","UrduTS":"اس کے بعد آدم نے اپنے رب سے کچھ (دعائیہ) کلمات سیکھے (اور ان کے مطابق دعا کی) تو وہ اس کی طرف (پھر فضل کے ساتھ) متوجہ ہوا۔ یقیناً وہی (بندوں کی مصیبت کے وقت) بہت ہی توجہ کرنے والا (اور) باربار رحم کرنے والا ہے۔ ","a":38,"s":2}
{"index":{"_id":46}}
{"Surah":"سورة البَقَرَة","ayah":"2:39","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":5,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"قُلْنَا ٱهْبِطُوا۟ مِنْهَا جَمِيعًا ۖ فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًى فَمَن تَبِعَ هُدَاىَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ","Urdu":"ہم نے کہا اس میں سے تم سب کے سب نکل جاؤ۔ پس جب کبھی بھی تمہارے پاس میری طرف سے ہدایت آئی تو جنہوں نے میری ہدایت کی پیروی کی ان پر کوئی خوف نہیں ہو گا اور نہ ہی وہ کوئی غم کریں گے۔","English":"We said: ‘Go forth, all of you, from here. And if there comes to you guidance from Me, then whoso shall follow My guidance, on them <i>shall come</i> no fear, nor shall they grieve.’","German":"Wir sprachen: \"Gehet hinaus, ihr alle, von hier. Und wer, wenn zu euch Weisung von Mir kommt, dann Meiner Weisung folgt, auf die soll keine Furcht kommen, noch sollen sie trauern.","Spanish":" Dijimos: “Salid todos de aquí. Y si os llega de mi parte una orientación, entonces <em>no sobrecogerá </em>el temor a quien quiera que siga mi orientación, ni sufrirá aflicción.”","French":"Nous avons dit : « Partez tous d’ici. Et s’il vous vient de Moi une direction, ceux qui suivront Ma direction ne seront ni dans la crainte ni ne seront-ils affligés. »","UrduTS":"(تب) ہم نے کہا (جاٶ) سب کے سب اس میں سے نکل جاٶ (اور یاد رکھو کہ) اگر پھر کبھی تمہارے پاس میری طرف سے کوئی ہدایت آئے تو جو لوگ میری ہدایت کی پیروی کریں گے انہیں نہ کوئی (آئندہ کا) خوف ہوگا اور نہ وہ (سابق کوتاہی پر) غمگین ہوں گے۔ ","a":39,"s":2}
{"index":{"_id":47}}
{"Surah":"سورة البَقَرَة","ayah":"2:40","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Ruku_sw":5,"Ruku_sw_per_Juz":5,"Juz":1,"Manzil":1,"Ruku":5,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَٱلَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايَٰتِنَآ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَٰلِدُونَ","Urdu":" اور وہ لوگ جنہوں نے انکار کیا اور ہمارے نشانات کو جھٹلایا وہی ہیں جو آگ میں پڑنے والے ہیں۔ وہ اس میں لمبا عرصہ رہنے والے ہیں۔","English":"But they who will disbelieve and treat Our Signs as lies, these shall be the inmates of the Fire; therein shall they abide.","German":"Die aber ungläubig sind und Unsere Zeichen leugnen, die sollen Bewohner des Feuers sein; darin müssen sie bleiben.\"","Spanish":" Pero los que no crean y traten de falaces nuestros Signos, ésos serán huéspedes del Fuego; y en él tendrán su morada.","French":"Mais ceux qui ne croient pas et qui considèrent Nos Signes comme des mensonges, ceux-là seront les compagnons du Feu où ils demeureront longtemps.","UrduTS":"اور جو (لوگ) کفر کریں گے اور ہماری آیات کو جھٹلائیں گے وہ (ضرور) دوزخ (میں پڑنے) والے ہیں۔ وہ اس میں رہتے چلے جائیں گے۔ ","a":40,"s":2}
{"index":{"_id":48}}
{"Surah":"سورة البَقَرَة","ayah":"2:41","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":6,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱذْكُرُوا۟ نِعْمَتِىَ ٱلَّتِىٓ أَنْعَمْتُ عَلَيْكُمْ وَأَوْفُوا۟ بِعَهْدِىٓ أُوفِ بِعَهْدِكُمْ وَإِيَّٰىَ فَٱرْهَبُونِ","Urdu":" اے بنی اسرائیل! اس نعمت کو یاد کرو جو میں نے تم پر کی اور میرے عہد کو پورا کرو، میں بھی تمہارے عہد کو پورا کروں گا اور بس مجھ ہی سے ڈرو۔","English":"O children of Israel! remember My favour which I bestowed upon you, and fulfil your covenant with Me, I will fulfil My covenant with you, and Me alone should you fear.","German":"O ihr Kinder Israels! gedenket Meiner Gnade, die Ich euch erwiesen, und erfüllet euren Bund mit Mir, so will Ich erfüllen Meinen Bund mit euch, und Mich allein sollt ihr fürchten.","Spanish":" ¡Oh Hijos de Israel! acordaos de los favores que os concedí y sed fieles a vuestro pacto conmigo; yo seré fiel a mi alianza con vosotros, y sólo a Mí debéis temer.","French":"Ô Enfants d’Israël ! Souvenez-vous des grâces que J’ai répandues sur vous. Respectez votre alliance avec Moi et Je respecterai Mon alliance avec vous et <em>c’est</em> Moi Seul que vous devez craindre.","UrduTS":"اے بنی اسرائیل! میرے اس احسان کو یاد کرو‘ جو میں تم پر کر چکا ہوں اور تم (نے) میرے (ساتھ جو) عہد (کیا تھا اس) کو پورا کرو۔ تب میں نے جو عہد تمہارے ساتھ کیا تھا میں اس کو پورا کروں گا اور مجھ (ہی) سے (ڈرو) پھر (میں کہتا ہوں کہ) مجھ (ہی) سے ڈرو۔ ","a":41,"s":2}
{"index":{"_id":49}}
{"Surah":"سورة البَقَرَة","ayah":"2:42","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":6,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَءَامِنُوا۟ بِمَآ أَنزَلْتُ مُصَدِّقًا لِّمَا مَعَكُمْ وَلَا تَكُونُوٓا۟ أَوَّلَ كَافِرٍۭ بِهِۦ ۖ وَلَا تَشْتَرُوا۟ بِـَٔايَٰتِى ثَمَنًا قَلِيلًا وَإِيَّٰىَ فَٱتَّقُونِ","Urdu":"اور اس پر ایمان لے آؤ جو میں نے اُس کی تصدیق کرتے ہوئے اتارا ہے جو تمہارے پاس ہے۔ اور اس کا انکار کرنے میں پہل نہ کرو اور میرے نشانات کے بدلے معمولی قیمت وصول نہ کرو اور بس میرا ہی تقویٰ اختیار کرو۔","English":"And believe in what I have sent down which fulfils that which is with you, and be not the first to disbelieve therein, and barter not My Signs for a paltry price, and take protection in Me alone.","German":"Und glaubet an das, was Ich hinabsandte, Bestätigung dessen, was bei euch ist, und seid nicht die ersten, ihm den Glauben zu versagen, und verhandelt nicht Meine Zeichen für einen armseligen Preis, und suchet Schutz bei Mir allein.","Spanish":" Y creed en lo que he revelado, que cumple lo que ya tenéis, y no seáis de los primeros en no creer en ello, ni troquéis Mis Signos por algo de bajo precio, y acogeos únicamente a Mi protección.","French":"Et croyez en ce que Je <em>vous</em> ai envoyé, en accomplissement de ce qui est <em>déjà</em> avec vous. Et ne soyez pas les premiers à ne pas y croire. Et n’échangez pas Mes Signes contre un vil prix et <em>c’est</em> Moi Seul que vous devez prendre comme protecteur.","UrduTS":"اور اس (کلام) پر ایمان لاٶ جو میں نے (اب) اتارا ہے (اور) جو اس (کلام) کو جو تمہارے پاس ہے سچا کرنے والا ہے اور تم اس کے (سب سے) پہلے کافر نہ بنو‘ اور میری آیتوں کے بدلے میں تھوڑی قیمت مت لو۔ اور مجھ (ہی) سے (ڈرو) پھر (میں کہتا ہوں کہ) مجھ (ہی) سے ڈرو۔ ","a":42,"s":2}
{"index":{"_id":50}}
{"Surah":"سورة البَقَرَة","ayah":"2:43","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":6,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَلَا تَلْبِسُوا۟ ٱلْحَقَّ بِٱلْبَٰطِلِ وَتَكْتُمُوا۟ ٱلْحَقَّ وَأَنتُمْ تَعْلَمُونَ","Urdu":"اور حق کو باطل سے خلط ملط نہ کرو اور حق کو چھپاؤ نہیں جبکہ تم جانتے ہو۔","English":"And confound not truth with falsehood nor hide the truth, knowingly.","German":"Und vermenget nicht Wahr mit Falsch noch verhehlet die Wahrheit wissentlich.","Spanish":" Y no confundáis la verdad con la falsedad ni escondáis a sabiendas la verdad.","French":"Et ne confondez pas la vérité avec le mensonge, et ne cachez pas sciemment la vérité.","UrduTS":"اور جانتے بوجھتے ہوئے حق کو باطل کے ساتھ نہ ملاٶ اور نہ حق کو (جانتے بوجھتے ہوئے) چھپاٶ۔ ","a":43,"s":2}
{"index":{"_id":51}}
{"Surah":"سورة البَقَرَة","ayah":"2:44","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":6,"Hisb":2,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَٱرْكَعُوا۟ مَعَ ٱلرَّٰكِعِينَ","Urdu":" اور نماز قائم کرو اور زکوٰۃ ادا کرو اور جُھکنے والوں کے ساتھ جھک جاؤ۔","English":"And observe Prayer and pay the Zakat, and bow down with those who bow.","German":"Und verrichtet das Gebet und zahlet die Zakât*, und beugt euch mit denen, die sich beugen**.","Spanish":" Y cumplid la Oración y pagad el <em>Zakat, </em>e inclinaos con los que se inclinan.","French":"Et observez la Prière et payez la Zakāt, et inclinez-vous avec ceux qui s’inclinent.","UrduTS":"اور نماز کو قائم رکھو اور زکٰوۃ دو‘ اور خدا کی خالص پرستش کرنے والوں کے ساتھ مل کر خدا کی خالص پرستش کرو۔ ","a":44,"s":2}
{"index":{"_id":52}}
{"Surah":"سورة البَقَرَة","ayah":"2:45","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","hisQ_sw":3,"Juz":1,"Manzil":1,"Ruku":6,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"۞ أَتَأْمُرُونَ ٱلنَّاسَ بِٱلْبِرِّ وَتَنسَوْنَ أَنفُسَكُمْ وَأَنتُمْ تَتْلُونَ ٱلْكِتَٰبَ ۚ أَفَلَا تَعْقِلُونَ","Urdu":" کیا تم لوگوں کو نیکی کا حکم دیتے ہو اور خود اپنے آپ کو بھول جاتے ہو جب کہ تم کتاب بھی پڑھتے ہو ۔ آخر تم عقل کیوں نہیں کرتے؟","English":"Do you enjoin others to do what is good and forget your own selves, while you read the Book? Will you not then understand?","German":"Wollt ihr andere ermahnen, das Rechte zu tun, und euer Selbst vergessen, obwohl ihr das Buch (Thora) leset? Wollt ihr denn nicht verstehen?","Spanish":" ¿Obligáis a otros a hacer buenas obras y vosotros lo olvidáis, mientras leéis el Libro? ¿No entenderéis, pues?","French":"Enjoindrez-vous aux autres de faire le bien alors que vous vous oubliez vous-mêmes, et alors même que vous lisez le Livre ? Ne comprenez-vous donc pas ?","UrduTS":"کیا تم (دوسرے) لوگوں کو (تو) نیکی (کرنے) کے لئے کہتے ہو اور اپنے آپ کو فراموش کر دیتے ہو؟  حالانکہ تم کتاب (یعنی تورات) پڑھتے ہو پھر (بھی) کیا تم عقل سے کام نہیں لیتے۔ ","a":45,"s":2}
{"index":{"_id":53}}
{"Surah":"سورة البَقَرَة","ayah":"2:46","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":6,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَٱسْتَعِينُوا۟ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى ٱلْخَٰشِعِينَ","Urdu":"اور صبر اور نماز کے ساتھ مدد مانگو اور یقیناً یہ عاجزی کرنے والوں کے سوا سب پر بوجھل ہے۔","English":"And seek help with patience and Prayer; and this indeed is hard except for the humble in spirit,","German":"Und sucht Hilfe in Geduld und Gebet; und das ist freilich schwer, es sei denn für die Demütigen im Geiste,","Spanish":" Y solicitad ayuda con paciencia y Oración; algo realmente difícil excepto para los humildes de espíritu,","French":"Et cherchez l’aide avec patience et dans la Prière. En vérité, cela est difficile sauf pour ceux qui sont humbles en esprit,","UrduTS":"اور صبر اور دعا کے ذریعہ سے (اللہ سے) مدد مانگو اور بے شک فروتنی اختیار کرنے والوں کے سوا (دوسروں کے لئے) یہ (امر) مشکل ہے۔ ","a":46,"s":2}
{"index":{"_id":54}}
{"Surah":"سورة البَقَرَة","ayah":"2:47","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Ruku_sw":6,"Ruku_sw_per_Juz":6,"Juz":1,"Manzil":1,"Ruku":6,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُوا۟ رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَٰجِعُونَ","Urdu":"(یعنی) وہ لوگ جو یقین رکھتے ہیں کہ وہ اپنے ربّ سے ملنے والے ہیں اور یہ کہ وہ اسی کی طرف لوٹ کر جانے والے ہیں۔","English":"Who know for certain that they will meet their Lord, and that to Him will they return.","German":"die für gewiss wissen, dass sie ihrem Herrn begegnen und dass sie zu Ihm wiederkehren werden.","Spanish":" Quienes saben con certeza que encontrarán a su Señor, y que a Él volverán.","French":"Qui savent, sans aucun doute, qu’<em>un jour</em> ils rencontreront leur Seigneur et c’est vers Lui qu’ils reviendront.","UrduTS":"(وہ فروتن) جو (اس بات پر) یقین رکھتے ہیں کہ وہ اپنے رب سے ملنے والے ہیں اور اس بات پر بھی کہ وہ اسی کی طرف لوٹ کر جانے والے ہیں۔ ","a":47,"s":2}
{"index":{"_id":55}}
{"Surah":"سورة البَقَرَة","ayah":"2:48","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱذْكُرُوا۟ نِعْمَتِىَ ٱلَّتِىٓ أَنْعَمْتُ عَلَيْكُمْ وَأَنِّى فَضَّلْتُكُمْ عَلَى ٱلْعَٰلَمِينَ","Urdu":" اے بنی اسرائیل! یاد کرو میری اُس نعمت کو جو میں نے تم پر کی اور یہ بھی کہ میں نے تمہیں سب جہانوں پر فضیلت دی۔","English":"O children of Israel! remember My favour which I bestowed upon you and that I exalted you above the peoples.","German":"O ihr Kinder Israels! gedenket Meiner Gnade, die Ich euch erwiesen, und dass Ich euch erhob über die Völker.","Spanish":" ¡Oh, Hijos de Israel! recordad los favores que Os concedí y que Os ensalcé por encima de los <em>demás</em> pueblos.","French":"Ô Enfants d’Israël ! Souvenez-vous des grâces que J’ai répandues sur vous et <em>rappelez-vous</em> que Je vous ai élevés au-dessus de tous les peuples <em>de l’époque</em>.","UrduTS":"اے بنی اسرائیل! میرے اس احسان کو جو میں تم پر کر چکا ہوں یاد کرو۔ اور (اس احسان کو بھی) کہ میں نے تمہیں تمام جہانوں پر فضیلت دی تھی۔ ","a":48,"s":2}
{"index":{"_id":56}}
{"Surah":"سورة البَقَرَة","ayah":"2:49","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَٱتَّقُوا۟ يَوْمًا لَّا تَجْزِى نَفْسٌ عَن نَّفْسٍ شَيْـًٔا وَلَا يُقْبَلُ مِنْهَا شَفَٰعَةٌ وَلَا يُؤْخَذُ مِنْهَا عَدْلٌ وَلَا هُمْ يُنصَرُونَ","Urdu":"اور ڈرو اس دن سے جب کوئی نفس کسی دوسرے نفس کے کچھ کام نہیں آئے گا اور نہ اس سے (اس کے حق میں) کوئی شفاعت قبول کی جائے گی اور نہ اس سے کوئی بدلہ وصول کیا جائے گا اور نہ وہ (لوگ) کسی قسم کی مدد دئیے جائیں گے۔","English":"And fear the day when no soul shall serve as a substitute for another soul at all, nor shall intercession be accepted for it; nor shall ransom be taken from it; nor shall they be helped.","German":"Und fürchtet den Tag, da keine Seele als Stellvertreterin wird dienen dürfen für eine andere Seele, da keine Fürbitte für sie gelten und kein Lösegeld von ihr genommen werden wird; und es wird ihnen nicht geholfen werden.","Spanish":" Y temed el día en que ningún alma podrá sustituir en absoluto a otra, ni se aceptará intersección alguna por ella, ni se recibirá rescate de ella; ni recibirán ayuda alguna.","French":"Et redoutez le jour où aucune âme ne pourra remplacer une autre, où aucune intercession ne sera acceptée pour elle, où aucune rançon ne sera reçue de sa part et où ils ne seront point secourus.","UrduTS":"اور اس دن سے ڈرو کہ (جس دن) کوئی شخص کسی دوسرے شخص کا قائم مقام نہ بن سکے گا اور نہ اس کی طرف سے کوئی سفارش منظور کی جائے گی اور نہ اس سے (کسی قسم کا) معاوضہ قبول کیا جائے گا اور نہ ان کی مدد کی جائے گی۔ ","a":49,"s":2}
{"index":{"_id":57}}
{"Surah":"سورة البَقَرَة","ayah":"2:50","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ نَجَّيْنَٰكُم مِّنْ ءَالِ فِرْعَوْنَ يَسُومُونَكُمْ سُوٓءَ ٱلْعَذَابِ يُذَبِّحُونَ أَبْنَآءَكُمْ وَيَسْتَحْيُونَ نِسَآءَكُمْ ۚ وَفِى ذَٰلِكُم بَلَآءٌ مِّن رَّبِّكُمْ عَظِيمٌ","Urdu":"اور (یاد کرو) جب ہم نے تمہیں فرعون کی قوم سے نجات بخشی جو تمہیں بہت سخت عذاب دیتے تھے ۔ وہ تمہارے بیٹوں کو تو قتل کر دیتے تھے اور تمہاری عورتوں کو زندہ رکھتے تھے اور اس میں تمہارے لئے تمہارے ربّ کی طرف سے بہت بڑی آزمائش تھی۔","English":"And <i>remember the time</i> when We delivered you from Pharaoh’s people who afflicted you with grievous torment, slaying your sons and sparing your women; and in that there was a great trial for you from your Lord.","German":"Und (gedenket der Zeit) da Wir euch erretteten von Pharaos Volk, das euch mit schlimmer Pein heimsuchte; sie erschlugen eure Söhne und schonten eurer Frauen; und darin war eine schwere Prüfung für euch von eurem Herrn.","Spanish":" Y <em>acordaos</em> de cuando Os libramos de las gentes del Faraón, que os afligían con crueles tormentos, matando a vuestros hijos y dejando vivir a vuestras mujeres. En eso había una gran prueba para vosotros por parte de vuestro Señor.","French":"Et <em>souvenez-vous</em> quand Nous vous avons délivrés du peuple de Pharaon qui vous infligeait le pire châtiment, massacrant vos fils et épargnant vos femmes. C’était là une très grande épreuve de la part de votre Seigneur.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب ہم نے تم کو فرعون کی قوم سے اس حالت میں نجات دی کہ وہ تمہیں بدترین عذاب دے رہی تھی تمہارے لڑکوں کو قتل کر دیتی تھی اور تمہاری عورتوں کو زندہ رکھتی تھی اور تمہارے رب کی طرف سے اس (بات) میں (تمہارے لئے) ایک بڑی آزمائش تھی۔ ","a":50,"s":2}
{"index":{"_id":58}}
{"Surah":"سورة البَقَرَة","ayah":"2:51","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ فَرَقْنَا بِكُمُ ٱلْبَحْرَ فَأَنجَيْنَٰكُمْ وَأَغْرَقْنَآ ءَالَ فِرْعَوْنَ وَأَنتُمْ تَنظُرُونَ","Urdu":"اور جب ہم نے تمہارے لئے سمندر کو پھاڑ دیا اور تمہیں نجات دی جب کہ ہم نے فرعون کی قوم کو غرق کر دیا اور تم دیکھ رہے تھے۔","English":"And <i>remember the time</i> when We divided the sea for you and saved you and drowned Pharaoh’s people, while you looked on.","German":"Und (gedenket der Zeit) da Wir das Meer teilten für euch und euch erretteten und das Volk Pharaos vor eurem Angesicht ertränkten.","Spanish":" Y <em>acordaos</em> de cuando separamos el mar para vosotros, os salvamos y ahogamos a las gentes del Faraón, mientras observabais.","French":"Et <em>souvenez-vous</em> quand Nous avons partagé la mer pour vous. Nous vous avons donc délivrés et Nous avons noyé le peuple de Pharaon sous vos yeux.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب ہم نے تمہارے لئے سمندر کو پھاڑا۔ پھر ہم نے تمہیں نجات دی اور تمہاری نظروں کے سامنے فرعون کی قوم کو غرق کر دیا۔ ","a":51,"s":2}
{"index":{"_id":59}}
{"Surah":"سورة البَقَرَة","ayah":"2:52","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ وَٰعَدْنَا مُوسَىٰٓ أَرْبَعِينَ لَيْلَةً ثُمَّ ٱتَّخَذْتُمُ ٱلْعِجْلَ مِنۢ بَعْدِهِۦ وَأَنتُمْ ظَٰلِمُونَ","Urdu":"اور جب ہم نے موسیٰ سے چالیس راتوں کا وعدہ کیا پھر اس کے (جانے کے) بعد تم بچھڑے کو (معبود) بنا بیٹھے اور تم ظلم کرنے والے تھے۔","English":"And <i>remember the time</i> when We made Moses a promise of forty nights; then you took the calf <i>for worship</i> in his absence and you were transgressors.","German":"Und (gedenket der Zeit) da Wir Moses ein Versprechen gaben für vierzig Nächte; ihr aber nahmet euch das Kalb in seiner Abwesenheit, und ihr verginget euch.","Spanish":" Y <em>acordaos</em> de cuando hicimos a Moisés una promesa de cuarenta noches; y entonces tomasteis el becerro <em>para adorarlo</em> y fuisteis transgresores.","French":"Et <em>souvenez-vous</em> quand Nous avons pris avec Moïse un engagement de quarante nuits. <em>C’est</em> alors <em>que</em>, pendant son absence, vous avez pris le veau <em>en adoration</em> et vous étiez des transgresseurs.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب ہم نے موسیٰ سے چالیس  راتوں کا وعدہ کیا پھر تم نے اس کے (چلے جانے کے) بعد ظالم بن کر بچھڑے کو (معبود) بنا لیا۔ ","a":52,"s":2}
{"index":{"_id":60}}
{"Surah":"سورة البَقَرَة","ayah":"2:53","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ثُمَّ عَفَوْنَا عَنكُم مِّنۢ بَعْدِ ذَٰلِكَ لَعَلَّكُمْ تَشْكُرُونَ","Urdu":"پھر اس کے باوجود ہم نے تم سے در گزر کیا تاکہ شاید تم شکر کرو۔","English":"Then We forgave you thereafter, that you might be grateful.","German":"Danach vergaben Wir euch, dass ihr möchtet dankbar sein.","Spanish":" Posteriormente, os perdonamos, para que pudierais ser agradecidos.","French":"En dépit de cela, Nous vous avons pardonné afin que vous soyez reconnaissants.","UrduTS":"پھر ہم نے اس کے بعد (بھی) تمہیں معاف کر دیا تا کہ تم شکر گزار بنو۔ ","a":53,"s":2}
{"index":{"_id":61}}
{"Surah":"سورة البَقَرَة","ayah":"2:54","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ ءَاتَيْنَا مُوسَى ٱلْكِتَٰبَ وَٱلْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُونَ","Urdu":"اور جب ہم نے موسیٰ کو کتاب اور فرقان دئیے تاکہ ہوسکے تو تم ہدایت پا جاؤ۔","English":"And <i>remember the time</i> when We gave Moses the Book and the Discrimination, that you might be rightly guided.","German":"Und (gedenket der Zeit) da Wir Moses die Schrift* gaben und das Entscheidende**, dass ihr möchtet rechtgeleitet sein.","Spanish":" Y <em>acordaos</em> de cuando dimos a Moisés el Libro y el Discernimiento, para que pudierais ser guiados rectamente.","French":"Et <em>souvenez-vous</em> quand Nous avons remis à Moïse le Livre et le Discernement, afin que vous soyez <em>bien</em> guidés.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب ہم نے موسیٰ کو کتاب (یعنی تورات) اور فرقان (یعنی معجزات) دئیے تا کہ تم ہدایت پاٶ۔ ","a":54,"s":2}
{"index":{"_id":62}}
{"Surah":"سورة البَقَرَة","ayah":"2:55","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦ يَٰقَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلْعِجْلَ فَتُوبُوٓا۟ إِلَىٰ بَارِئِكُمْ فَٱقْتُلُوٓا۟ أَنفُسَكُمْ ذَٰلِكُمْ خَيْرٌ لَّكُمْ عِندَ بَارِئِكُمْ فَتَابَ عَلَيْكُمْ ۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","Urdu":"اور جب موسیٰ نے اپنی قوم سے کہا، اے میری قوم! یقیناً تم نے بچھڑے کو (معبود) بنا کر اپنی جانوں پر ظلم کیا۔ پس توبہ کرتے ہوئے اپنے پیدا کرنے والے کی طرف متوجہ ہو اور اپنے نفوس کو قتل کرو۔ یہ تمہارے لئے تمہارے پیدا کرنے والے کے نزدیک بہت بہتر ہے ۔ پس وہ تم پر توبہ قبول کرتے ہوئے مہربان ہوا۔ یقیناً وہی بہت توبہ قبول کرنے والا (اور) بار بار رحم کرنے والا ہے۔","English":"And <i>remember the time</i> when Moses said to his people: ‘O my people, you have indeed wronged yourselves by taking the calf <i>for worship</i>; turn you therefore to your Maker, and kill your evil desires; that is the best for you with your Maker.’ Then He turned towards you with compassion. Surely, He is Oft-Returning <i>with compassion, and is</i> Merciful.","German":"Und (gedenket der Zeit) da Moses zu seinem Volke sprach: \"O mein Volk, du hast dich wahrlich an dir selbst versündigt, als du dir das Kalb nahmest; kehre dich denn zu deinem Schöpfer und töte dich selbst*; das ist am besten für dich vor deinem Schöpfer.\" Da kehrte Er Sich wieder gnädig zu euch. Wahrlich, Er ist der oft gnädig Sich Wendende, der Barmherzige.","Spanish":" Y <em>acordaos </em>de cuando Moisés dijo a su pueblo: “Oh, pueblo mío, en verdad habéis obrado mal con vosotros mismos tomando al becerro <em>para adorarlo</em>; volved pues a vuestro Creador y practicad la automortificación; eso será lo mejor para vosotros ante vuestro Creador.” Entonces Él volvió a vosotros <em>con compasión</em>. En verdad, Él es Remisorio <em>con compasión </em>y es Misericordioso.","French":"Et <em>souvenez-vous</em> quand Moïse dit à son peuple : « Ô mon peuple, en vérité, vous vous êtes fait du tort en prenant le veau <em> comme dieu</em>. Tournez-vous donc avec repentir vers votre Créateur et supprimez vos mauvais désirs, cela est meilleur pour vous auprès de votre Créateur. » Alors Il Se tourna vers vous avec clémence. Assurément, Il est Celui Qui revient sans cesse avec compassion ; <em>Il est</em> le Miséricordieux.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب موسیٰ نے اپنی قوم سے کہا کہ اے میری قوم (کے لوگو)! تم نے بچھڑے کو (معبود) بنا کر یقیناً اپنی جانوں پر ظلم کیا ہے اس لئے تم اپنے پیدا کرنے والے کی طرف جھکو‘ اور ہر شخص اپنے آپ کو قتل کردے۔ یہ بات تمہارے پیدا کرنے والے کے نزدیک تمہارے حق میں بہت اچھی ہے (جب تم نے ایسا کر لیا) تب اس نے تمہاری طرف فضل کے ساتھ پھر توجہ کی وہ یقیناً (اپنے بندوں کی طرف) بہت توجہ کرنے والا بار بار رحم کرنے والا ہے۔ ","a":55,"s":2}
{"index":{"_id":63}}
{"Surah":"سورة البَقَرَة","ayah":"2:56","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ قُلْتُمْ يَٰمُوسَىٰ لَن نُّؤْمِنَ لَكَ حَتَّىٰ نَرَى ٱللَّهَ جَهْرَةً فَأَخَذَتْكُمُ ٱلصَّٰعِقَةُ وَأَنتُمْ تَنظُرُونَ","Urdu":"اور جب تم نے کہا کہ اے موسیٰ ! ہم ہرگز تمہاری نہیں مانیں گے یہاں تک کہ ہم اللہ کو ظاہر باہر دیکھ نہ لیں ۔ پس تمہیں آسمانی بجلی نے آپکڑا اور تم دیکھتے رہ گئے۔","English":"And <i>remember</i> when you said: ‘O Moses, we will by no means believe thee until we see Allah face to face;’ then the thunderbolt overtook you, while you gazed.","German":"Und (gedenket der Zeit) da ihr sprachet: \"O Mose, wir wollen dir auf keine Weise glauben, ehe wir nicht Allah von Angesicht zu Angesicht schauen\"; da ereilte euch der Donnerschlag, dieweil ihr schautet.","Spanish":" Y <em>acordaos</em> de cuando dijisteis: “Oh, Moisés, no creeremos en ti en absoluto mientras no veamos a Al-lah cara a cara;” entonces el rayo os arrebató mientras mirabais.","French":"Et <em>souvenez-vous</em> quand vous avez dit : « Ô Moïse, nous ne te croirons pas avant d’avoir vu Allāh face à face. » C’est alors que, pendant que vous regardiez, la foudre vous frappa.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب تم نے کہا تھا کہ اے موسیٰ! ہم تیری بات ہرگز نہیں مانیں گے جب تک ہم اللہ کو آمنے سامنے نہ دیکھ لیں‘ اس پر تمہیں ایک مہلک عذاب نے پکڑ لیا اور تم (اپنی آنکھوں  سے اپنے فعل کا انجام) دیکھ رہے تھے۔ ","a":56,"s":2}
{"index":{"_id":64}}
{"Surah":"سورة البَقَرَة","ayah":"2:57","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ثُمَّ بَعَثْنَٰكُم مِّنۢ بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ","Urdu":"پھر ہم نے تمہاری موت (کی سی حالت) کے بعد تمہیں اٹھایا تاکہ تم شکر کرو۔","English":"Then We raised you up after your death, that you might be grateful.","German":"Dann richteten Wir euch auf nach eurem Tode, dass ihr möchtet dankbar sein.","Spanish":" Acto seguido, os resucitamos después de vuestra muerte, para que fuerais agradecidos.","French":"Alors Nous vous avons ressuscités après votre <em> état ressemblant à la</em> mort afin que vous soyez reconnaissants.","UrduTS":"پھر ہم نے تمہاری ہلاکت کے بعد تمہیں اس لئے اٹھایا کہ تم شکر گزار بنو۔ ","a":57,"s":2}
{"index":{"_id":65}}
{"Surah":"سورة البَقَرَة","ayah":"2:58","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَظَلَّلْنَا عَلَيْكُمُ ٱلْغَمَامَ وَأَنزَلْنَا عَلَيْكُمُ ٱلْمَنَّ وَٱلسَّلْوَىٰ ۖ كُلُوا۟ مِن طَيِّبَٰتِ مَا رَزَقْنَٰكُمْ ۖ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ","Urdu":"اور ہم نے تم پر بادلوں کو سایہ فگن کیا اور تم پر ہم نے مَن اور سلو ٰی اُتارے۔ جو رزق ہم نے تمہیں دیا ہے اس میں سے پاکیزہ چیزیں کھاﺅ ۔ اور انہوں نے ہم پر ظلم نہیں کیا بلکہ خود اپنے اوپر ہی ظلم کرنے والے تھے۔","English":"And We caused the clouds to be a shade over you and sent down on you Manna and Salwa, <i>saying</i>: ‘Eat of the good things We have provided for you.’ And they wronged Us not, but it was themselves that they wronged.","German":"Und Wir ließen die Wolken euch überschatten und sandten euch Manna und Salwa* hernieder: \"Esset von den guten Dingen, die Wir euch beschert haben.\" Und sie schädigten nicht Uns, sondern sich selbst haben sie Schaden getan.","Spanish":" E hicimos que las nubes os cubrieran con su sombra y os enviamos el Manna y las Salwa, <em>diciendo: </em>“Comed de las cosas buenas que os hemos proporcionado.” Y no nos hicieron daño a Nos, sino a sí mismos.","French":"Et Nous avons fait les nuages vous couvrir de leur ombre. Et Nous avons fait descendre sur vous Manna et Salwā <em>en disant</em> : « Mangez de ces bonnes choses que Nous vous avons accordées comme provision. » Et ils ne Nous ont fait aucun tort, mais c’est à eux-mêmes qu’ils ont fait du tort.","UrduTS":"اور ہم نے تم پر بادلوں کا سایہ کیا اور تمہارے لئے من اور سلوے اتارے۔ (اور کہا کہ) ان پاک چیزوں میں سے جو ہم نے تم کو دی ہیں کھاٶ۔ اور انہوں نے (نافرمانی کرکے) ہمارا نقصان نہیں کیا بلکہ وہ اپنا ہی نقصان کر رہے تھے۔ ","a":58,"s":2}
{"index":{"_id":66}}
{"Surah":"سورة البَقَرَة","ayah":"2:59","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ قُلْنَا ٱدْخُلُوا۟ هَٰذِهِ ٱلْقَرْيَةَ فَكُلُوا۟ مِنْهَا حَيْثُ شِئْتُمْ رَغَدًا وَٱدْخُلُوا۟ ٱلْبَابَ سُجَّدًا وَقُولُوا۟ حِطَّةٌ نَّغْفِرْ لَكُمْ خَطَٰيَٰكُمْ ۚ وَسَنَزِيدُ ٱلْمُحْسِنِينَ","Urdu":"اور جب ہم نے کہا کہ اس بستی میں داخل ہو جاؤ اور اس میں سے جہاں سے بھی چاہو بافراغت کھاؤ اور (صدر) دروازے میں اطاعت کرتے ہوئے داخل ہو اور کہو کہ بوجھ ہلکے کئے جائیں ۔ ہم تمہاری خطائیں تمہیں معاف کردیں گے اور احسان کرنے والوں کو ہم ضرور اور بھی زیادہ دیں گے۔","English":"And <i>remember the time</i> when We said: “Enter this village and eat therefrom  —  wherever you will  —   plentifully; and enter the gate submissively and say: ‘<i>God</i>! forgive us our sins.’ We shall forgive you your sins and We shall give increase to those who do good.”","German":"Und (gedenket der Zeit) da Wir sprachen: \"Tretet ein in diese Stadt und esset reichlich von dem Ihren – wo immer ihr wollt – und tretet unterwürfig ein durch das Tor und sprechet: \"Vergebung!\" Wir werden euch eure Sünden vergeben und Wir werden jene mehren, die Gutes tun.\"","Spanish":" Y <em>acordaos </em>de cuando dijimos: “Entrad en este pueblo y comed de sus bienes –donde queráis- hasta saciaros; y entrad humildemente por la puerta y decid: “¡Dios! Perdónanos nuestros pecados.” Os perdonaremos vuestros pecados y aumentaremos Nuestros favores a quienes hagan buenas obras.”","French":"Et <em>souvenez-vous</em> quand Nous avons dit : « Entrez dans cette ville et mangez-y abondamment partout où vous voudrez et entrez par la porte <em>centrale</em> en soumission en disant : <em>Dieu !</em> Pardonne-nous nos péchés. » Nous vous pardonnerons vos péchés et Nous donnerons davantage aux bienfaisants.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب ہم نے کہا تھا کہ اس بستی میں داخل ہو جاٶ اور اس میں سے جہاں سے چاہو بافراغت کھاٶ اور (اس کے) دروازے میں پوری فرمانبرداری کرتے ہوئے داخل ہو اور کہتے جاٶ (کہ ہم) بوجھ ہلکا کرنے کی التجا (کرتے ہیں‘ تب) ہم تمہاری خطاٶں کو بالکل معاف کر دیں گے اور ہم محسنوں کو ضرور بڑھائیں گے۔ ","a":59,"s":2}
{"index":{"_id":67}}
{"Surah":"سورة البَقَرَة","ayah":"2:60","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Ruku_sw":7,"Ruku_sw_per_Juz":7,"Juz":1,"Manzil":1,"Ruku":7,"Hisb":3,"Sajda_id":"","Sajda_Obligation":"","Arabic":"فَبَدَّلَ ٱلَّذِينَ ظَلَمُوا۟ قَوْلًا غَيْرَ ٱلَّذِى قِيلَ لَهُمْ فَأَنزَلْنَا عَلَى ٱلَّذِينَ ظَلَمُوا۟ رِجْزًا مِّنَ ٱلسَّمَآءِ بِمَا كَانُوا۟ يَفْسُقُونَ","Urdu":"پس ان لوگوں نے جنہوں نے ظلم کیا اُس بات کو جو انہیں کہی گئی تھی کسی اور بات میں بدل دیا۔ پس ہم نے ظلم کرنے والوں پر آسمان سے ایک عذاب نازل کیا بسبب اُس کے جو وہ نافرمانی کرتے تھے۔","English":"The transgressors changed <i>it</i> for a word other than that which was said to them. So We sent down upon the transgressors a punishment from heaven, because they were disobedient.","German":"Die Ungerechten vertauschten das Wort, das zu ihnen gesprochen ward, mit einem anderen. So sandten Wir auf die Ungerechten eine Strafe vom Himmel, weil sie ungehorsam waren.","Spanish":" Los transgresores<em> la</em> cambiaron por una palabra contraria a la que se les había dicho. Por tanto enviamos desde los cielos un castigo a los injustos, porque fueron desobedientes.","French":"Mais ceux qui ont transgressé changèrent <em>cela</em> en une autre parole que celle qui leur avait été dite. Alors, Nous avons envoyé une punition du ciel sur les transgresseurs, parce qu’ils étaient désobéissants.","UrduTS":"پھر (ان کی شرارت دیکھو کہ) ظالموں نے اس بات کے خلاف جو انہیں کہی گئی تھی ایک اور بات بدل (کر کہنی شروع کر) دی جس پر ہم نے ان لوگوں پر جنہوں نے ظلم کیا تھا ان کے نافرمان ہونے کے سبب سے آسمان سے ایک عذاب نازل کیا۔ ","a":60,"s":2}
{"index":{"_id":68}}
{"Surah":"سورة البَقَرَة","ayah":"2:61","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","hisQ_sw":4,"Juz":1,"Manzil":1,"Ruku":8,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"۞ وَإِذِ ٱسْتَسْقَىٰ مُوسَىٰ لِقَوْمِهِۦ فَقُلْنَا ٱضْرِب بِّعَصَاكَ ٱلْحَجَرَ ۖ فَٱنفَجَرَتْ مِنْهُ ٱثْنَتَا عَشْرَةَ عَيْنًا ۖ قَدْ عَلِمَ كُلُّ أُنَاسٍ مَّشْرَبَهُمْ ۖ كُلُوا۟ وَٱشْرَبُوا۟ مِن رِّزْقِ ٱللَّهِ وَلَا تَعْثَوْا۟ فِى ٱلْأَرْضِ مُفْسِدِينَ","Urdu":"اور جب موسیٰ نے اپنی قوم کے لئے پانی مانگا تو ہم نے کہا کہ چٹان پر اپنے عصا سے ضرب لگاؤ۔ تب اس میں سے بارہ چشمے پھوٹ پڑے اور سب لوگوں نے اپنے اپنے پانی پینے کی جگہ معلوم کر لی۔ اللہ کے رزق سے کھاؤ اور پیو اور زمین میں فسادی بنتے ہوئے بداَمنی نہ پھیلاؤ۔","English":"And <i>remember the time</i> when Moses prayed for water for his people, and We said: ‘Strike the rock with thy rod,’ and there gushed forth from it twelve springs, <i>so that</i> every tribe knew their drinking place. ‘Eat and drink of what Allah has provided, and commit not iniquity in the earth, creating disorder.’","German":"Und (gedenket der Zeit) da Moses um Wasser betete für sein Volk und Wir sprachen: \"Schlage an den Felsen mit deinem Stab\", und zwölf Quellen brachen aus ihm hervor; jeder Stamm kannte seinen Trinkplatz. \"Esset und trinket von Allahs Gaben und verübt nicht Unheil auf Erden, indem ihr Unfrieden stiftet.\"","Spanish":" Y <em>acordaos </em>cuando Moisés pidió agua para su pueblo y dijimos: “Golpea la roca con tu bastón”, y de ella brotaron doce fuentes, a <em>fin de que </em>cada tribu supiera en qué lugar debía beber. “Comed y bebed de lo que Al-lah ha proporcionado, y no cometáis iniquidades en la tierra, creando el desorden.”","French":"Et <em>souvenez-vous</em> quand Moïse pria pour que son peuple ait de l’eau et Nous avons dit : « Frappe le rocher de ton bâton » ; et il en jaillit douze sources <em>afin que</em> chaque tribu sût où elle devait boire. « Mangez et buvez de la provision d'Allāh. Et ne commettez pas d’iniquité sur terre comme des fauteurs de désordre. »","UrduTS":"اور (اس وقت کو بھی یاد کرو) جو موسیٰ نے اپنی قوم کے لئے پانی مانگا تو ہم نے (اسے) کہا کہ اپنا سونٹا فلاں پتھر پر مار۔ اس پر اس میں سے بارہ چشمے پھوٹ پڑے (اور) ہر ایک گروہ نے اپنے گھاٹ کو پہچان لیا‘ (تب انہیں کہا گیا کہ) اللہ کے رزق میں سے کھاٶ اور پیو اور مفسد بن کر زمین میں خرابی نہ پیدا کرو۔ ","a":61,"s":2}
{"index":{"_id":69}}
{"Surah":"سورة البَقَرَة","ayah":"2:62","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Ruku_sw":8,"Ruku_sw_per_Juz":8,"Juz":1,"Manzil":1,"Ruku":8,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ قُلْتُمْ يَٰمُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍ وَٰحِدٍ فَٱدْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنۢبِتُ ٱلْأَرْضُ مِنۢ بَقْلِهَا وَقِثَّآئِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا ۖ قَالَ أَتَسْتَبْدِلُونَ ٱلَّذِى هُوَ أَدْنَىٰ بِٱلَّذِى هُوَ خَيْرٌ ۚ ٱهْبِطُوا۟ مِصْرًا فَإِنَّ لَكُم مَّا سَأَلْتُمْ ۗ وَضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ وَٱلْمَسْكَنَةُ وَبَآءُو بِغَضَبٍ مِّنَ ٱللَّهِ ۗ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلنَّبِيِّۦنَ بِغَيْرِ ٱلْحَقِّ ۗ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ","Urdu":"اور جب تم نے کہا اے موسیٰ! ہم ایک ہی کھانے پر ہرگز صبر نہیں کر سکیں گے ۔ پس ہمارے لئے اپنے ربّ سے دعا کر کہ وہ ہمارے لئے وہ چیزیں نکالے جو زمین اُگاتی ہے از قسم اپنی سبزیوں کے اور اپنی ککڑیوں کے اور اپنی گندم کے اور اپنی دالوں کے اور اپنے پیاز کے۔اس نے کہا کیا تم تبدیل کرنا چاہتے ہو اُس سے جو ادنیٰ ہے اُس چیز کو جو بہتر ہے؟ تم کسی شہر میں داخل ہو جاؤ۔ یقیناً تمہیں وہ مل جائے گا جو تم نے طلب کیا ہے۔ اور ان پر ذلت اور مسکینی کی مار ڈالی گئی اور وہ اللہ کا غضب لے کر لوٹے۔ یہ اس لئے ہوا کہ وہ اللہ کے نشانات کا انکار کیا کرتے تھے اور انبیاءکو ناحق قتل کرتے تھے۔ (ہاں) یہ اس لئے ہوا کہ انہوں نے نافرمانی کی اور وہ حد سے تجاوز کیا کرتے تھے۔","English":"And <i>remember the time</i> when you said: ‘O Moses, surely, we will not remain content with one <i>kind of</i> food; pray, then, to thy Lord for us that He bring forth for us of what the earth grows — of its herbs and its cucumbers and its wheat and its lentils and its onions.’ He said: ‘Would you take in exchange that which is inferior for that which is superior? Go down to some town, and there is for you what you ask.’ And they were smitten with abasement and destitution, and they incurred the wrath of Allah: that was because they rejected the Signs of Allah and would kill the Prophets unjustly; that was because they rebelled and transgressed.","German":"Und (gedenket der Zeit) da ihr sprachet: \"O Mose, gewiss, wir werden uns nicht zufrieden geben mit einerlei Speise; bitte also deinen Herrn für uns, dass Er für uns hervorbringe von dem, was die Erde wachsen lässt – von ihren Kräutern und ihren Gurken und ihrem Weizen und ihren Linsen und ihren Zwiebeln.\" Er sprach: \"Wolltet ihr das Geringere in Tausch nehmen für das Bessere? Geht in irgendeine Stadt, und ihr werdet finden, was ihr verlangt.\" Und sie wurden mit Schande und Elend geschlagen, und sie luden Allahs Zorn auf sich; dies, weil sie die Zeichen Allahs verwarfen und die Propheten zu Unrecht töten wollten; das war, weil sie widerspenstig waren und frevelten.","Spanish":" Y <em>acordaos</em> de cuando dijisteis: “Oh, Moisés, ciertamente no soportaremos una sola <em>clase de</em> comida; ruega, pues, a tu Señor por nosotros para que haga brotar a nuestro favor lo que la tierra produce: sus hierbas, sus pepinos, su trigo, sus lentejas y sus cebollas”. Él dijo: “¿Acaso vais a cambiar lo inferior por lo superior? Bajad a alguna ciudad y allí tendréis lo que pedís.” Y fueron golpeados con el abatimiento y la pobreza, e incurrieron en la cólera de Al-lah: así ocurrió porque rechazaron los Signos de Al-lah y mataron injustamente a los Profetas; y fue porque se rebelaron y fueron transgresores.","French":"Et <em>souvenez-vous</em> quand vous aviez dit : « Ô Moïse, en vérité nous ne pouvons plus nous contenter d’une seule <em>sorte de</em> nourriture. Prie donc ton Seigneur en notre faveur afin qu’Il fasse sortir pour nous de ce que la terre produit, de ses légumes, ses concombres, son froment, ses lentilles, ses oignons. » Il répondit : « Voudrez-vous prendre ce qui est inférieur en échange de ce qui est supérieur ? Descendez dans une ville quelconque où vous trouverez ce que vous demandez. » Et ils furent frappés d’humiliation et de misère et ils encoururent la colère d’Allāh. C’était parce qu’ils avaient rejeté les Signes d’Allāh, et mettaient injustement les Prophètes à mort <em>chaque fois qu’ils le pouvaient</em> ; c’était parce qu’ils avaient désobéi et avaient transgressé.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب تم نے کہا تھا کہ اے موسیٰ! ہم ایک ہی کھانے پر صبر نہیں کر سکیں گے اس لئے تو ہمارے لئے اپنے رب سے دعا کر کہ وہ ہمارے لئے بعض ایسی چیزیں جنہیں زمین اگاتی ہے پیدا کرے۔ یعنی اس کی سبزیاں‘ ککڑیاں‘ گیہوں‘ مسور اور پیاز۔ (اس پر اللہ نے) کہا کہ کیا تم اس چیز کی بجائے جو اعلیٰ ہے اس چیز کو لینا چاہتے ہو جو ادنیٰ ہے۔ کسی شہر میں چلے جاٶ (وہاں) جو کچھ تم نے مانگا ہے تمہیں ضرور مل جائے گا (تب) انہیں ہمیشہ کے لئے ذلیل اور بے بس کر دیا گیا اور وہ اللہ کے غضب کا مورد بن گئے۔ یہ اس وجہ سے (ہوا) کہ وہ اللہ کی آیتوں کا انکار کرتے تھے اور نبیوں کو ناحق قتل کرنا چاہتے تھے (اور) یہ (گناہ) ان کے نافرمانی کرنے اور حد سے بڑھے ہوئے ہونے کے سبب سے (ان میں پیدا ہو گیا) تھا۔ ","a":62,"s":2}
{"index":{"_id":70}}
{"Surah":"سورة البَقَرَة","ayah":"2:63","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":9,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَادُوا۟ وَٱلنَّصَٰرَىٰ وَٱلصَّٰبِـِٔينَ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ وَعَمِلَ صَٰلِحًا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ","Urdu":"یقیناً وہ لوگ جو ایمان لائے اور وہ جو یہودی ہیں اور نصاریٰ اور دیگر الٰہی کتب کے ماننے والے جو بھی اللہ پر اور آخرت کے دن پر ایمان لائے، اور نیک اعمال بجا لائے ان سب کے لئے اُن کا اجر اُن کے ربّ کے پاس ہے اور ان پر کوئی خوف نہیں اور نہ وہ غم کریں گے۔","English":"Surely, the Believers, and the Jews, and the Christians and the Sabians — whichever party <i>from among these truly</i> believes in Allah and the Last Day and does good deeds — shall have their reward with their Lord, and no fear <i>shall come</i> upon them, nor shall they grieve.","German":"Wahrlich, die Gläubigen und die Juden und die Christen und die Sabäer – wer immer (unter diesen) wahrhaft an Allah glaubt und an den Jüngsten Tag und gute Werke tut –, sie sollen ihren Lohn empfangen von ihrem Herrn, und keine Furcht soll über sie kommen, noch sollen sie trauern.","Spanish":" Ciertamente, los creyentes, los judíos, los cristianos y los sabeos –y cualquiera <em>de entre aquellos</em> que crea <em>verdaderamente</em> en Al-lah y el Último Día y haga buenas obras tendrán su recompensa con su Señor y no les <em>sobrecogerá</em> el temor, ni se afligirán.","French":"En vérité, les Croyants, et les Juifs, et les Chrétiens et les Sabéens, tous ceux qui croient <em>sincèrement</em> en Allāh et au Jour Dernier et qui font de bonnes œuvres, auront leur récompense auprès de leur Seigneur. Ils ne seront ni dans la crainte, ni ne seront-ils affligés.","UrduTS":"جو لوگ ایمان لائے ہیں اور جو یہودی ہیں نیز نصاریٰ اور صابی (ان میں سے) جو (فریق) بھی اللہ پر اور آخرت کے دن پر (کامل) ایمان لایا ہے اور اس نے نیک عمل کیے ہیں یقیناً ان کے لئے ان کے رب کے پاس ان کا (مناسب) اجر ہے اور انہیں نہ (تو مستقبل کے متعلق) کسی قسم کا خوف ہوگا اور نہ (ماضی پر) وہ غمگین ہوں گے۔ ","a":63,"s":2}
{"index":{"_id":71}}
{"Surah":"سورة البَقَرَة","ayah":"2:64","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":9,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ أَخَذْنَا مِيثَٰقَكُمْ وَرَفَعْنَا فَوْقَكُمُ ٱلطُّورَ خُذُوا۟ مَآ ءَاتَيْنَٰكُم بِقُوَّةٍ وَٱذْكُرُوا۟ مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ","Urdu":" اور جب ہم نے (تم سے) تمہارا پختہ عہد لیا اور طُور کو تم پر بلند کیا ۔ اسے مضبوطی سے پکڑ لو جو ہم نے تمہیں دیا ہے اور اسے یاد رکھو جو اس میں ہے تاکہ تم (ہلاکت سے) بچ سکو۔","English":"And <i>remember the time</i> when We took a covenant from you and raised high above you the Mount, <i>saying</i>: ‘Hold fast that which We have given you and bear in mind what is therein, that you may be saved.’","German":"Und (gedenket der Zeit) da Wir einen Bund schlossen mit euch und den Berg hoch über euch ragen ließen (und sprachen): \"Haltet fest, was Wir euch gegeben haben, und bewahret in eurem Sinn, was darinnen ist, auf dass ihr errettet werdet.\"","Spanish":" Y <em>acordaos</em> de cuando aceptamos vuestra alianza y elevamos sobre vosotros el Monte, <em>diciendo:</em> “Sujetad con fuerza lo que os hemos dado y recordad lo que contiene, a fin de que os salvéis.”","French":"Et <em>souvenez-vous</em> quand Nous avons conclu un pacte avec vous, et que Nous avons élevé le Mont au-dessus de vous, <em>Nous avons dit</em> : « Tenez ferme à ce que Nous vous avons donné, et souvenez-vous de<em>tout</em> ce qu’il contient, afin que vous soyez sauvés <em>de la destruction</em>. »","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب ہم نے تم سے پختہ عہد لیا تھا اور طور کو تمہارے اوپر بلند کیا تھا (اور کہا تھا کہ) جو (کچھ) ہم نے تمہیں دیا ہے اسے مضبوطی سے پکڑ لو اور جو کچھ اس میں ہے اسے یاد رکھو‘ تا کہ تم متقی بن جاٶ۔ ","a":64,"s":2}
{"index":{"_id":72}}
{"Surah":"سورة البَقَرَة","ayah":"2:65","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":9,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ثُمَّ تَوَلَّيْتُم مِّنۢ بَعْدِ ذَٰلِكَ ۖ فَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ لَكُنتُم مِّنَ ٱلْخَٰسِرِينَ","Urdu":" پھر اس کے بعد بھی تم پھر گئے۔ پس اگر اللہ کا (خاص) فضل اور اس کی رحمت تم پر نہ ہوتے تو تم ضرور نقصان اٹھانے والوں میں سے ہو جاتے۔","English":"Then you turned back thereafter; and had it not been for Allah’s grace towards you and His mercy, you would surely have been of the losers.","German":"Danach aber kehrtet ihr euch ab; und wäre nicht Allahs Huld und Seine Gnade für euch gewesen, ihr wäret gewiss unter den Verlierern.","Spanish":" Pero, después de esto, os alejasteis; y de no haber sido por la gracia de Al-lah para vosotros y por Su misericordia, ciertamente os contaríais entre los desventurados.","French":"Puis vous vous <em>en</em> êtes détournés après cela, et n’eussent-été la grâce et la miséricorde d’Allāh sur vous, vous auriez sûrement été parmi les perdants.","UrduTS":"پھر اس (واضح ہدایت کے مل جانے) کے بعد (بھی) تم نے پیٹھ پھیر لی اور اگر تم پر اللہ کا فضل اور اس کی رحمت نہ ہوتی تو تم ضرور نقصان اٹھانے والوں میں سے ہو جاتے۔ ","a":65,"s":2}
{"index":{"_id":73}}
{"Surah":"سورة البَقَرَة","ayah":"2:66","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":9,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَلَقَدْ عَلِمْتُمُ ٱلَّذِينَ ٱعْتَدَوْا۟ مِنكُمْ فِى ٱلسَّبْتِ فَقُلْنَا لَهُمْ كُونُوا۟ قِرَدَةً خَٰسِـِٔينَ","Urdu":" اور یقیناً تم ان لوگوں کو جان چکے ہو جنہوں نے تم میں سے سَبت کے بارہ میں تجاوز کیا تو ہم نے ان سے کہا کہ ذلیل بندر بن جاؤ۔","English":"And surely, you have known <i>the end of</i> those amongst you, who transgressed in the matter of the Sabbath. So We said to them: ‘Be ye apes, despised.’","German":"Und sicherlich habt ihr Kenntnis von (dem Ende) derer unter euch, die das Sabbatgebot übertraten. So sprachen Wir zu ihnen: \"Seid denn Affen, Verachtete.\"","Spanish":" Y ciertamente, habéis conocido <em>la suerte </em>de aquellos de vosotros que violaron lo relacionado con el Sabbath. Por eso les dijimos, “Volveos monos despreciables.”","French":"Et vous avez sûrement appris <em>la fin réservée à</em> ceux des vôtres qui transgressèrent en ce qui concerne le Sabbat. Nous leur avons dit : « Soyez <em>comme</em> des singes, méprisés. »","UrduTS":"اور تم ان لوگوں (کے انجام) کو جنہوں نے تم میں سے (ہوتے ہوئے) سبت کے معاملہ میں زیادتی کی تھی یقیناً جان چکے ہو‘ اس پر ہم نے انہیں کہا تھا کہ (جاٶ) ذلیل بندر بن جاٶ۔ ","a":66,"s":2}
{"index":{"_id":74}}
{"Surah":"سورة البَقَرَة","ayah":"2:67","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":9,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"فَجَعَلْنَٰهَا نَكَٰلًا لِّمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةً لِّلْمُتَّقِينَ","Urdu":" پس ہم نے اس (سَبت کی بے حرمتی) کو اس کے پیش منظر کی وجہ سے اور اس کے پس منظر کی وجہ سے سرزنش کا باعث بنا دیا اور متقیوں کے لئے ایک عظیم نصیحت (بنایا)۔","English":"Thus We made it an example to those of its time and to those who came after it, and a lesson to those who fear God.","German":"Also machten Wir dies zu einem warnenden Beispiel für die, die damals waren, und für die, die nachher kamen, und zu einer Lehre für die Gottesfürchtigen.","Spanish":" Así lo convertimos en un ejemplo para sus contemporáneos y para los que vinieron después, y en una lección para los que temen a Dios.","French":"Ainsi Nous en avons fait un exemple pour leurs contemporains et pour ceux qui devaient leur succéder, ainsi qu’un avertissement pour ceux qui ont la crainte d’Allāh.","UrduTS":"پس ہم نے اس (واقعہ) کو ان (لوگوں) کے لئے بھی جو (اس وقت) موجود تھے اور اس (وقوعہ) کے بعد آنے والے لوگوں کے لئے بھی (موجب) عبرت اور متقیوں کے لئے (موجب) نصیحت بنا دیا۔ ","a":67,"s":2}
{"index":{"_id":75}}
{"Surah":"سورة البَقَرَة","ayah":"2:68","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":9,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦٓ إِنَّ ٱللَّهَ يَأْمُرُكُمْ أَن تَذْبَحُوا۟ بَقَرَةً ۖ قَالُوٓا۟ أَتَتَّخِذُنَا هُزُوًا ۖ قَالَ أَعُوذُ بِٱللَّهِ أَنْ أَكُونَ مِنَ ٱلْجَٰهِلِينَ","Urdu":"اور جب موسیٰ نے اپنی قوم سے کہا کہ یقیناً اللہ تمہیں حکم دیتا ہے کہ تم ایک (امتیاز رکھنے والی) گائے کو ذبح کرو۔ انہوں نے کہا کیا تو ہمیں ہنسی کا نشانہ بنا رہا ہے؟ اس نے کہا کہ میں اللہ کی پناہ مانگتا ہوں اس بات سے کہ میں جاہلوں میں سے ہو جاؤں۔","English":"And <i>remember</i> when Moses said to his people: ‘Allah commands you to slaughter a cow,’ they said: ‘Dost thou make a jest of us?’ He said: ‘I seek refuge with Allah from being one of the ignorant.’","German":"Und (denket daran) als Moses zu seinem Volke sprach: \"Allah befiehlt euch, eine Kuh zu schlachten\"; da sagten sie: \"Treibst du Spott mit uns?\" Er sprach: \"Ich suche Zuflucht bei Allah, dass ich nicht sei der Unwissenden einer.\"","Spanish":" Y <em>acordaos</em> de cuando Moisés dijo a su pueblo: “Al-lah os ordena sacrificar una vaca”, y ellos dijeron: “¿Acaso pretendes burlarte de nosotros?” Dijo: “Busco refugio en Al-lah para no ser uno de los ignorantes.”","French":"Et <em>souvenez-vous</em> quand Moïse dit à son peuple : « Assurément, Allāh vous commande d’immoler une vache, » ils répondirent : « Te moques-tu de nous ? » Alors il dit : « Allāh me préserve d’être du nombre des ignorants ! »","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب موسیٰ نے اپنی قوم سے کہا کہ اللہ تمہیں گائے کے ذبح کرنے کا حکم دیتا ہے‘ انہوں نے کہا کیا تو ہمیں تمسخر کا نشانہ بناتا ہے؟ (موسیٰ  نے) کہا میں (اس بات  سے) اللہ کی پناہ مانگتا ہوں کہ (ایسا فعل کرکے) جاہلوں میں شامل ہو جاٶں۔ ","a":68,"s":2}
{"index":{"_id":76}}
{"Surah":"سورة البَقَرَة","ayah":"2:69","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":9,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِىَ ۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَلَا بِكْرٌ عَوَانٌۢ بَيْنَ ذَٰلِكَ ۖ فَٱفْعَلُوا۟ مَا تُؤْمَرُونَ","Urdu":"انہوں نے کہا اپنے ربّ سے ہماری خاطر دعا کر کہ وہ ہمارے لئے واضح کردے کہ وہ کیا ہے؟ اس نے کہا یقیناً وہ کہتا ہے کہ وہ ایک گائے ہے، نہ بہت بوڑھی اور نہ بہت کم عمر، اس کے بین بین درمیانی عمر کی ہے۔ پس وہی کرو جو تمہیں حکم دیا جاتا ہے۔","English":"They said: ‘Pray for us to thy Lord that He make plain to us what she is.’ He answered: ‘<i>God</i> says, it is a cow, neither old nor young, fullgrown, between the two; now do what you are commanded.’","German":"Sie sprachen: \"Bitte deinen Herrn für uns, dass Er uns deutlich mache, was sie ist.\" Er antwortete: \"Er spricht, es ist eine Kuh, weder alt noch jung, voll erwachsen, zwischen beidem; nun tut, wie euch geboten.\"","Spanish":" Ellos dijeron: “Ruega por nosotros a tu Señor para que nos indique cómo es”. Respondió: “<em>Dios</em> dice: es una vaca, ni vieja ni joven, ya crecida, de edad intermedia entre las dos; y ahora haced lo que se os manda.”","French":"Ils dirent : « Prie ton Seigneur pour nous afin qu’Il nous explique comment elle est. » Il leur répondit : « <em>Allāh</em> dit que c’est une vache ni jeune, ni vieille, mais pleinement grandie entre les deux ; maintenant, faites ce qui vous est commandé. »","UrduTS":"انہوں نے کہا‘ ہماری خاطر اپنے رب سے دعا کیجیے ٔ  کہ وہ ہمیں کھول کر بتائے کہ وہ (گائے) کیسی ہے؟ اس نے (یعنی موسیٰ نے) کہا کہ وہ فرماتا ہے وہ ایسی گائے ہے کہ نہ تو بڑھیا ہے اور نہ بچھیا‘ بلکہ اس کے درمیان پوری جوان ہے اس لئے جو حکم تمہیں دیا جاتا ہے اسے بجا لاٶ۔ ","a":69,"s":2}
{"index":{"_id":77}}
{"Surah":"سورة البَقَرَة","ayah":"2:70","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":9,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوْنُهَا ۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌ صَفْرَآءُ فَاقِعٌ لَّوْنُهَا تَسُرُّ ٱلنَّٰظِرِينَ","Urdu":" انہوں نے کہا اپنے ربّ سے ہماری خاطر دعا کر کہ وہ ہمارے لئے واضح کردے کہ اس کا رنگ کیا ہے ۔ اس نے کہا یقیناً وہ کہتا ہے کہ وہ لازماً ایک زرد گائے ہے جس کا رنگ بہت شوخ ہے ۔ وہ دیکھنے والوں کو خوش کر دیتی ہے۔","English":"They said: ‘Pray for us to thy Lord that He make plain to us what colour she is.’ He answered: ‘<i>God</i> says, it is a cow of a dun colour, pure and rich <i>in tone</i>; delighting the beholders.’","German":"Sie sprachen: \"Bitte deinen Herrn für uns, dass Er uns deutlich mache, welches ihre Farbe ist.\" Er antwortete: \"Er spricht, es ist eine Kuh von hellgelber Farbe, rein und reich im Ton; eine Lust den Beschauenden.\"","Spanish":" Dijeron: “Ruega por nosotros a tu Señor para que nos indique de qué color es”. Él respondió: “<em>Dios</em> dice que es una vaca de color pardo, <em>de tono</em> puro y rico; que agrada a cuantos la miran.”","French":"Ils dirent : « Prie ton Seigneur pour nous pour qu’Il nous explique de quelle couleur elle est. » Il <em>leur</em> répondit : « <em>Allāh</em> dit que c’est une vache jaune, <em>d’une nuance</em> riche et pure qui réjouit les yeux de ceux qui <em>la</em> regardent. »","UrduTS":"انہوں نے کہا‘ ہماری خاطر اپنے رب سے (پھر) دعا کیجیے ٔ کہ وہ ہمیں کھول کر بتائے کہ اس کا رنگ کیا ہے؟ (موسیٰ نے) کہا‘ وہ فرماتا ہے کہ وہ ایک زرد رنگ کی گائے ہے‘ اس کا رنگ بہت شوخ ہے (اور) وہ دیکھنے والوں کو بہت پسند آتی ہے۔ ","a":70,"s":2}
{"index":{"_id":78}}
{"Surah":"سورة البَقَرَة","ayah":"2:71","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":9,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِىَ إِنَّ ٱلْبَقَرَ تَشَٰبَهَ عَلَيْنَا وَإِنَّآ إِن شَآءَ ٱللَّهُ لَمُهْتَدُونَ","Urdu":"انہوں نے کہا اپنے ربّ سے ہماری خاطر دعا کر کہ وہ ہم پر (مزید) واضح کرے کہ وہ کیا ہے؟ یقیناً سب گائیاں ہم پر مشتبہ ہوگئی ہیں ۔ اور ہم یقیناً اِن شَاءاللّٰہ ضرور ہدایت پانے والے ہیں۔","English":"They said: ‘Pray for us to thy Lord that He make plain to us what she is, for <i>all such</i> cows appear to us alike; and if Allah please, we shall indeed be guided.’","German":"Sie sprachen: \"Bitte deinen Herrn für uns, dass Er uns deutlich mache, welche es ist; denn (alle solchen) Kühe scheinen uns gleich; und wenn es Allah gefällt, werden wir rechtgeleitet sein.\"","Spanish":" Dijeron: “Ruega por nosotros a tu Señor para que nos indique cómo es, ya que para nosotros todas esas vacas se asemejan.” Y si Al-lah quiere, ciertamente, seremos guiados.","French":"Ils dirent : « Prie ton Seigneur pour nous pour qu’Il dise précisément ce qu’elle est, car pour nous, toutes les vaches sont pareilles ; et, s’il plaît à Allāh, nous serons certainement guidés. »","UrduTS":"انہوں نے کہا‘ ہماری خاطر اپنے رب سے (پھر) دعا کیجیے ٔ کہ وہ ہمیں کھول کر بتائے کہ وہ (گائے) کیسی ہے؟ ہمیں تو اس  قسم کی (سب) گائیں ایک ہی جیسی نظر آتی ہیں اور (یقین رکھیے کہ) اگر اللہ نے چاہا تو ہم ضرور ہدایت کو قبول کر لیں گے۔ ","a":71,"s":2}
{"index":{"_id":79}}
{"Surah":"سورة البَقَرَة","ayah":"2:72","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Ruku_sw":9,"Ruku_sw_per_Juz":9,"Juz":1,"Manzil":1,"Ruku":9,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌ لَّا ذَلُولٌ تُثِيرُ ٱلْأَرْضَ وَلَا تَسْقِى ٱلْحَرْثَ مُسَلَّمَةٌ لَّا شِيَةَ فِيهَا ۚ قَالُوا۟ ٱلْـَٰٔنَ جِئْتَ بِٱلْحَقِّ ۚ فَذَبَحُوهَا وَمَا كَادُوا۟ يَفْعَلُونَ","Urdu":"اس نے کہا بلاشبہ وہ کہتا ہے کہ وہ ضرور ایک ایسی گائے ہے جسے اس غرض سے َجوت نہیں ڈالی گئی کہ وہ زمین میں ہل چلائے اور نہ وہ کھیتوں کو سیراب کرتی ہے۔ وہ صحیح سلامت ہے ۔ اُس میں کوئی داغ نہیں ۔ انہوں نے کہا کہ اب تُو سچی بات لایا ہے ۔ پس انہوں نے اسے ذبح کر دیا جبکہ وہ (پہلے ایسا) کرنے والے نہ تھے۔","English":"He answered: ‘<i>God</i> says, it is a cow not broken in to plough the earth or water the tilth; one without blemish; of one colour.’ They said: ‘Now hast thou brought the truth.’ Then they slaughtered her, though they would rather not do so.","German":"Er antwortete: \"Er spricht, es ist eine Kuh, nicht gebeugt unter das Joch, das Land zu pflügen oder den Acker zu wässern; eine ohne Tadel; von einerlei Farbe.\" Sie sprachen: \"Nun hast du die Wahrheit gebracht.\" Dann schlachteten sie sie, obgleich sie es ungern taten.","Spanish":" Respondió: “<em>Dios</em> dice que es una vaca no agotada a fuerza de arar la tierra o regar los cultivos; un animal sin tacha; de un solo color”. Dijeron: “Ahora has traído la verdad”. Entonces la sacrificaron, aunque a punto estuvieron de no hacerlo.","French":"Il répondit : « <em>Allāh</em> dit qu’il s’agit d’une vache qui n’a été rompue ni au labourage du sol ni à l’arrosage des champs, d’une <em>vache</em> sans tare <em>et</em> d’une seule couleur. » Ils dirent : « Maintenant, tu <em>nous</em> as apporté la vérité. » Puis ils l’immolèrent, bien qu’ils eussent été presque à ne pas <em>le</em> faire.","UrduTS":"(موسیٰ نے) کہا‘ وہ فرماتا ہے کہ وہ ایسی گائے ہے جو نہ تو جوئے کے نیچے لائی گئی ہے کہ ہل چلاتی ہو اور نہ کھیتی کو پانی دیتی ہے‘ بالکل تندرست ہے‘اس میں کوئی غیر رنگ نہیں (پایا جاتا) انہوں نے کہا اب تو نے (ہم پر) حقیقت کھول دی ہے‘ چنانچہ انہوں نے اس (گائے) کو ذبح کر دیا‘ گو وہ ایسا کرنے پر آمادہ نہ تھے۔ ","a":72,"s":2}
{"index":{"_id":80}}
{"Surah":"سورة البَقَرَة","ayah":"2:73","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":10,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ قَتَلْتُمْ نَفْسًا فَٱدَّٰرَْٰٔتُمْ فِيهَا ۖ وَٱللَّهُ مُخْرِجٌ مَّا كُنتُمْ تَكْتُمُونَ","Urdu":"اور جب تم نے ایک نفس کو قتل کیا اور پھر اس بارہ میں اختلاف کیا اور اللہ نے اس بھید کو ظاہر کرنا ہی تھا جو تم چھپائے ہوئے تھے۔","English":"And <i>remember the time</i> when you slew a person and differed among yourselves about it; and Allah would bring to light what you concealed.","German":"Und (gedenket der Zeit) da ihr einen Menschen erschluget und darüber uneinig waret; und Allah würde ans Licht bringen, was ihr verhehltet.*","Spanish":" Y <em>acordaos</em> de cuando matasteis a una persona y disputasteis entre vosotros por ese motivo, y Al-lah sacó a la luz lo que ocultasteis.","French":"Et <em>souvenez-vous</em> quand vous avez tué un homme et que vous vous êtes disputés à ce propos. Et Allāh devait éclaircir ce que vous dissimuliez.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب تم نے ایک شخص کو قتل (کرنے کا دعویٰ) کیا‘ پھر تم نے اس کے بارے میں اختلاف کیا‘ حالانکہ جو (کچھ) تم چھپاتے تھے اللہ اسے ظاہر کرنے والا تھا۔ ","a":73,"s":2}
{"index":{"_id":81}}
{"Surah":"سورة البَقَرَة","ayah":"2:74","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":10,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"فَقُلْنَا ٱضْرِبُوهُ بِبَعْضِهَا ۚ كَذَٰلِكَ يُحْىِ ٱللَّهُ ٱلْمَوْتَىٰ وَيُرِيكُمْ ءَايَٰتِهِۦ لَعَلَّكُمْ تَعْقِلُونَ","Urdu":" پس ہم نے کہا (کھوج لگانے کی خاطر) اس جیسی اور واردات پر اس (واقعہ) کو چسپاں کرو۔ اسی طرح اللہ مُردوں کو (ان کے قاتلوں کا مؤاخذہ کر کے) زندہ کرتا ہے اور تمہیں اپنے نشان دکھاتا ہے تا کہ تم عقل کرو۔","English":"Then We said: ‘Smite him (the murderer) for a part of <i>the offence against</i> him (the murdered person).’ Thus Allah gives life to the dead and shows you His Signs that you may understand.","German":"Da sprachen Wir: \"Vergleicht diesen (Fall) mit Ähnlichem.\" So gibt Allah Leben den Toten und weist euch Seine Zeichen, dass ihr begreifen möget.","Spanish":" Entonces dijimos: “Castigadlo severamente (al asesino) por una parte <em>de la ofensa realizada contra </em>él” (la víctima). Así Al-lah da vida a los <em>espiritualmente</em> muertos y os muestra Sus Signos para que entendáis.","French":"Alors Nous avons dit : « Comparez ceci à d’autres <em>incidents</em> semblables » <em>et vous découvrirez la vérité.</em> C’est ainsi qu’Allāh ressuscite les morts et vous montre Ses Signes afin que vous puissiez comprendre.","UrduTS":"اس پر ہم نے کہا کہ اس (واقعہ) کو اس (نفس) کے ساتھ پیش آنے والے بعض اور واقعات سے ملا کر دیکھو (پھر تمہیں حقیقت معلوم ہو جائے گی) اللہ اسی طرح مردوں کو زندہ کرتا ہے اور تم کو اپنے نشان دکھاتا ہے تا کہ تم عقل کرو۔ ","a":74,"s":2}
{"index":{"_id":82}}
{"Surah":"سورة البَقَرَة","ayah":"2:75","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":10,"Hisb":4,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ثُمَّ قَسَتْ قُلُوبُكُم مِّنۢ بَعْدِ ذَٰلِكَ فَهِىَ كَٱلْحِجَارَةِ أَوْ أَشَدُّ قَسْوَةً ۚ وَإِنَّ مِنَ ٱلْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ ٱلْأَنْهَٰرُ ۚ وَإِنَّ مِنْهَا لَمَا يَشَّقَّقُ فَيَخْرُجُ مِنْهُ ٱلْمَآءُ ۚ وَإِنَّ مِنْهَا لَمَا يَهْبِطُ مِنْ خَشْيَةِ ٱللَّهِ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ","Urdu":"پھر اس کے بعد تمہارے دل سخت ہو گئے گویا وہ پتھروں کی طرح تھے یا پھر سختی میں اس سے بھی بڑھ کر۔ جبکہ پتھروں میں سے بھی یقیناً بعض ایسے ہوتے ہیں کہ اُن سے نہریں پھوٹ پڑتی ہیں ۔ اور یقیناً ان میں سے ایسے بھی ہیں کہ جو پھٹ جائیں تو ان میں سے پانی نکلتا ہے ۔ پھر ان میں یقیناً ایسے بھی ہیں جو اللہ کی خشیت سے گر پڑتے ہیں ۔ اور اللہ اُس سے غافل نہیں ہے جو تم کرتے ہو۔","English":"Then your hearts became hardened after that, till they were like stones or harder still; for of stones indeed there are some out of which gush forth streams, and of them there are some out of which flows water when they cleave asunder. And indeed, of them there are some that humble themselves for fear of Allah. And Allah is not unmindful of what you do.","German":"Danach aber wurden eure Herzen verhärtet, bis sie wie Steine waren oder noch härter; denn unter den Steinen sind ja solche, aus denen Ströme hervorbrechen, und solche, aus denen Wasser fließt, wenn sie sich spalten. Und gewiss sind unter ihnen manche, die sich demütigen in der Furcht Allahs; und Allah ist nicht achtlos eures Tuns.","Spanish":" Luego, posteriormente, se endurecieron vuestros corazones, hasta ser como piedras o aún más duros; pues en cuanto a las piedras hay, en verdad, algunas de las que brotan ríos y algunas de las que, una vez partidas, sale agua. Y en verdad, entre ellas hay otras que se humillan por temor a Al-lah. Y Al-lah no ignora lo que hacéis.","French":"Mais ensuite vos cœurs se sont endurcis, au point de devenir comme des pierres et encore plus durs car, en vérité, il y a des pierres d’où jaillissent des ruisseaux, et il y en a d’autres d’où coule de l’eau quand elles se fendent. Et très certainement, il y a certains parmi eux qui s’humilient par crainte d’Allāh. Et Allāh n’est pas inattentif à ce que vous faites.","UrduTS":"اس کے بعد پھر تمہارے دل سخت ہو گئے‘ چنانچہ وہ پتھروں کی طرح بلکہ ان سے بھی زیادہ سخت ہیں اور پتھروں میں سے تو یقیناً بعض ایسے بھی ہوتے ہیں جن میں سے دریا بہتے ہیں اور ان میں سے بعض ایسے بھی ہوتے ہیں کہ پھٹ جاتے ہیں تو ان میں سے پانی نکلنے لگتا ہے اور ان (دلوں) میں سے (بھی) بعض ایسے ہیں کہ اللہ کے ڈر سے (معافی مانگتے ہوئے) گر جاتے ہیں اور جو (کچھ) تم کر رہے ہو اللہ اس سے ہر گز بے خبر نہیں ہے۔ ","a":75,"s":2}
{"index":{"_id":83}}
{"Surah":"سورة البَقَرَة","ayah":"2:76","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","hisQ_sw":5,"Juz":1,"Manzil":1,"Ruku":10,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"۞ أَفَتَطْمَعُونَ أَن يُؤْمِنُوا۟ لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِّنْهُمْ يَسْمَعُونَ كَلَٰمَ ٱللَّهِ ثُمَّ يُحَرِّفُونَهُۥ مِنۢ بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ","Urdu":"کیا تم یہ امید لگائے بیٹھے ہو کہ وہ لوگ تمہاری بات مان جائیں گے جب کہ ان میں سے ایک گروہ کلام الہٰی کو سنتا ہے اور اسے اچھی طرح سمجھنے کے باوجود اس میں تحریف کرتا ہے اور وہ خوب جانتے ہیں۔","English":"Do you expect that they will believe you when a party of them hear the word of Allah, then pervert it after they have understood it, and they know <i>the consequences thereof </i>?","German":"Erwartet ihr, dass sie (die Juden) euch glauben, wenn ein Teil von ihnen das Wort Allahs hört, es dann verdreht, nachdem sie es begriffen, und sie kennen (die Folgen) davon?","Spanish":" ¿Mantenéis la esperanza de que os crean cuando una parte de ellos ha pervertido conscientemente la palabra de Al-lah después de que la hubieran escuchado y la hubieran entendido y la conocieran perfectamente?","French":"Gardez-vous espoir qu’ils croiront en vous, alors même qu’un groupe des leurs se sont déjà attachés à déformer <em>délibérément</em> la parole d’Allāh après qu’ils l’aient entendue, qu’ils l’aient comprise et qu’ils <em>l’</em>aient sue très clairement ?","UrduTS":"(اے مسلمانو)! کیا تم امید رکھتے ہو کہ وہ (یہودی) تمہاری بات مان لیں گے‘ حالانکہ ان میں سے کچھ لوگ ایسے ہیں جو اللہ کے کلام کو سنتے ہیں‘ پھر اسے سمجھ لینے کے بعد اس (کے مطلب) کو بگاڑ دیتے ہیں اور وہ (اس عمل کے بدنتائج کو خوب) جانتے ہیں۔ ","a":76,"s":2}
{"index":{"_id":84}}
{"Surah":"سورة البَقَرَة","ayah":"2:77","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":10,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذَا لَقُوا۟ ٱلَّذِينَ ءَامَنُوا۟ قَالُوٓا۟ ءَامَنَّا وَإِذَا خَلَا بَعْضُهُمْ إِلَىٰ بَعْضٍ قَالُوٓا۟ أَتُحَدِّثُونَهُم بِمَا فَتَحَ ٱللَّهُ عَلَيْكُمْ لِيُحَآجُّوكُم بِهِۦ عِندَ رَبِّكُمْ ۚ أَفَلَا تَعْقِلُونَ","Urdu":"اور جب وہ ان لوگوں سے ملتے ہیں جو ایمان لائے تو کہتے ہیں کہ ہم بھی ایمان لے آئے۔ اور جب ان میں سے بعض بعض دوسروں کی طرف الگ ہو جاتے ہیں تو وہ (ان سے) کہتے ہیں کہ کیا تم ان کو وہ باتیں بتاتے ہو جو اللہ نے تم پر کھولی ہیں تا کہ انہی باتوں کے ذریعہ وہ تمہارے ربّ کے حضور تم سے جھگڑا کریں۔ پس کیا تم عقل نہیں کرتے۔","English":"And when they meet those who believe, they say: ‘We believe,’ and when they meet one another in private, they say: ‘Do you inform them of what Allah has unfolded to you, that they may thereby argue with you before your Lord? Will you not then understand?’","German":"Und wenn sie den Gläubigen begegnen, sagen sie: \"Wir glauben\", und wenn sie einander heimlich begegnen, dann sagen sie: \"Wolltet ihr jenen mitteilen, was Allah euch enthüllt hat, dass sie deswegen mit euch streiten vor eurem Herrn? Begreift ihr das denn nicht?\"*","Spanish":" Y cuando encuentran a los creyentes, dicen: “Creemos”, pero cuando se reúnen en privado, unos con otros, dicen: “¿Les informáis de lo que Al-lah os ha revelado, para que puedan así discutir con vosotros ante vuestro Señor?”. ¿No comprenderéis entonces?","French":"Et lorsqu’ils rencontrent ceux qui croient, ils disent : « Nous croyons, » et quand ils se rencontrent en particulier, ils disent : « Leur parlerez-vous de ce qu’Allāh vous a dévoilé, afin qu’ils en fassent un argument contre vous devant votre Seigneur ? Vous ne comprenez donc pas ? »","UrduTS":"اور جب یہ لوگ مومنوں سے ملتے ہیں تو کہہ دیتے ہیں کہ ہم مومن ہیں اور جب ایک دوسرے سے علیحدگی میں ملتے ہیں تو (ایک دوسرے کو الزام دیتے ہوئے) کہتے ہیں کیا تم انہیں وہ باتیں جو اللہ نے تم پر کھولی ہیں بتاتے ہو اس کا نتیجہ یہ ہوگا کہ وہ ان (معلومات) کے ذریعہ سے اللہ کے سامنے تم پر حجت قائم کریں گے۔ کیا تم عقل سے کام نہیں لیتے؟ ","a":77,"s":2}
{"index":{"_id":85}}
{"Surah":"سورة البَقَرَة","ayah":"2:78","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":10,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"أَوَلَا يَعْلَمُونَ أَنَّ ٱللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ","Urdu":"کیا وہ نہیں جانتے کہ یقینا اللہ جانتا ہے جو وہ چھپاتے ہیں اور جو وہ ظاہر کرتے ہیں۔","English":"Do they not know that Allah knows what they conceal and what they disclose?","German":"Wissen sie nicht, dass Allah weiß, was sie verbergen und was sie kundtun?","Spanish":" ¿Acaso no saben que Al-lah conoce lo que ocultan y lo que revelan?","French":"Ne savent-ils pas qu’Allāh connaît ce qu’ils dissimulent et ce qu’ils dévoilent ?","UrduTS":"کیا یہ (اس بات کو) نہیں جانتے کہ جو کچھ وہ چھپاتے ہیں اور جو کچھ وہ ظاہر کرتے ہیں اللہ اسے جانتا ہے۔ ","a":78,"s":2}
{"index":{"_id":86}}
{"Surah":"سورة البَقَرَة","ayah":"2:79","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":10,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَمِنْهُمْ أُمِّيُّونَ لَا يَعْلَمُونَ ٱلْكِتَٰبَ إِلَّآ أَمَانِىَّ وَإِنْ هُمْ إِلَّا يَظُنُّونَ","Urdu":"اور ان میں ایسے جاہل بھی ہیں جو (اپنی) خواہشات کے علاوہ کتاب کا کوئی علم نہیں رکھتے اور وہ محض قیاس آرائیاں کرتے ہیں۔","English":"And some of them are illiterate; they know not the Book but <i>their own</i> false notions, and they <i>do nothing</i> but conjecture.","German":"Und einige unter ihnen sind Schriftunkundige; sie kennen das Buch nicht, nur eitle Wünsche, und sie meinen bloß.","Spanish":" Y algunos de ellos son analfabetos; no conocen el Libro sino <em>sus propias</em> falsas concepciones, y <em>no hacen más</em> que conjeturas.","French":"Et il y a parmi eux des illettrés ; ceux-ci ne connaissent rien du Livre à part <em>leurs propres</em> idées erronées. Ils ne font que conjecturer.","UrduTS":"اور ان میں سے بعض ان پڑھ ہیں جو چند جھوٹی باتوں کے سوا اپنی کتاب کا کچھ بھی علم نہیں رکھتے اور وہ صرف تک بندیاں کرتے رہتے ہیں۔ ","a":79,"s":2}
{"index":{"_id":87}}
{"Surah":"سورة البَقَرَة","ayah":"2:80","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":10,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"فَوَيْلٌ لِّلَّذِينَ يَكْتُبُونَ ٱلْكِتَٰبَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هَٰذَا مِنْ عِندِ ٱللَّهِ لِيَشْتَرُوا۟ بِهِۦ ثَمَنًا قَلِيلًا ۖ فَوَيْلٌ لَّهُم مِّمَّا كَتَبَتْ أَيْدِيهِمْ وَوَيْلٌ لَّهُم مِّمَّا يَكْسِبُونَ","Urdu":" پس ہلاکت ہے ان کے لئے جو اپنے ہاتھوں سے کتاب لکھتے ہیں پھر کہتے ہیں کہ یہ اللہ کی طرف سے ہے تاکہ وہ اس کے بدلے کچھ معمولی قیمت وصول کر لیں۔ پس ہلاکت ہے ان کے لئے اُس کے نتیجہ میں جو ان کے ہاتھوں نے لکھا اور ہلاکت ہے اُن کے لئے اس کی وجہ سے جو وہ کماتے ہیں۔","English":"Woe, therefore, to those who write the Book with their own hands, and then say: ‘This is from Allah,’ that they may take for it a paltry price. Woe, then, to them for what their hands have written, and woe to them for what they earn.","German":"Wehe darum denen, die das Buch schreiben mit ihren eigenen Händen und dann sprechen: \"Dies ist von Allah\", dass sie dafür einen armseligen Preis nehmen möchten! Wehe ihnen also um dessentwillen, was ihre Hände geschrieben, und wehe ihnen um dessentwillen, was sie verdienen!","Spanish":" ¡Ay, pues, de aquellos que escriben el Libro con sus propias manos y después dicen: “Esto viene de Al-lah”, para poder pedir por él un precio ridículo! ¡Ay, pues, de ellos por lo que han escrito sus manos, y ¡Ay! de ellos por lo que ganaron!","French":"Malheur donc à ceux qui écrivent le Livre de leurs <em>propres</em> mains et disent ensuite : « Ceci émane d’Allāh, » afin d’en recevoir un prix dérisoire ! Malheur donc à eux pour ce que leurs mains ont écrit et malheur à eux pour ce qu’ils gagnent !","UrduTS":"پس جو لوگ اپنے ہاتھوں سے کتاب لکھتے ہیں (اور) پھر اس کے ذریعہ سے (کچھ) تھوڑی سی قیمت حاصل کرنے کے لئے کہہ دیتے ہیں کہ یہ (کتاب) اللہ کی طرف سے ہے ان کے لئے (ایک سخت) عذاب (مقدر) ہے۔ پھر (ہم کہتے ہیں کہ) ان کے لئے ان کے ہاتھوں کے لکھے کے سبب سے (ایک سخت) عذاب (مقدر) ہے اور اس کے سبب سے (بھی) عذاب (مقدر) ہے جو وہ کماتے ہیں۔ ","a":80,"s":2}
{"index":{"_id":88}}
{"Surah":"سورة البَقَرَة","ayah":"2:81","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":10,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَقَالُوا۟ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامًا مَّعْدُودَةً ۚ قُلْ أَتَّخَذْتُمْ عِندَ ٱللَّهِ عَهْدًا فَلَن يُخْلِفَ ٱللَّهُ عَهْدَهُۥٓ ۖ أَمْ تَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعْلَمُونَ","Urdu":"اور وہ کہتے ہیں ہمیں آگ ہرگز نہیں چھوئے گی مگر گنتی کے چند دن۔ تُو کہہ دے کیا تم نے اللہ سے کوئی عہد لے رکھا ہے۔ پس اللہ ہرگز اپنے عہد کی خلاف ورزی نہیں کرے گا یا پھر تم خدا کی طرف ایسی باتیں منسوب کر رہے ہو جن کا تمہیں کوئی علم نہیں۔","English":"And they say: ‘The Fire shall not touch us except for a <i>small</i> number of days.’ Say: ‘Have you taken a promise from Allah? Then, Allah will never break His promise. Or, do you say of Allah what you know not?’","German":"Und sie sprechen: \"Das Feuer wird uns nicht berühren, es sei denn für eine geringe Zahl von Tagen.\" Sprich: \"Habt ihr ein Versprechen von Allah empfangen? Dann freilich wird Allah nimmer Sein Versprechen brechen. Oder sagt ihr von Allah, was ihr nicht wisst?\"","Spanish":" Y dicen: “El Fuego no nos tocará sino durante un número <em>reducido</em> de días” Diles: “¿Habéis recibido una promesa de Al-lah? Si es así, Al-lah nunca incumplirá Su promesa. O bien ¿afirmáis de Al-lah lo que desconocéis?”.","French":"Et ils disent : « Le Feu <em>de l’Enfer</em> ne nous touchera que pour quelques jours comptés. » Dis-<em>leur</em> : « Avez-vous pris une promesse d’Allāh ? Alors, Allāh ne manquera pas à Sa promesse. Où est-ce que vous dites d’Allāh ce que vous ne savez pas ? »","UrduTS":"اور وہ کہتے ہیں کہ ہمیں چند گنتی کے دنوں کے سوا (دوزخ کی) آگ ہر گز نہ چھوئے گی۔ تو (ان سے) کہہ کیا تم نے اللہ کی بارگاہ سے کوئی عہد لیا (ہوا) ہے؟ (اگر ایسا ہے) تب تو وہ ہرگز اپنے عہد کے خلاف نہیں کرے گا‘ یا تم اللہ کے متعلق ایسی بات کہتے ہو‘ جس کا تمہیں (کوئی) علم نہیں ہے۔ ","a":81,"s":2}
{"index":{"_id":89}}
{"Surah":"سورة البَقَرَة","ayah":"2:82","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":10,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"بَلَىٰ مَن كَسَبَ سَيِّئَةً وَأَحَٰطَتْ بِهِۦ خَطِيٓـَٔتُهُۥ فَأُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَٰلِدُونَ","Urdu":"حقیقت یہ ہے کہ جس نے بھی بدی کمائی یہاں تک کہ اس کی خطاؤں نے اس کو گھیرے میں لے لیا ہو تو یہی لوگ ہیں جو آگ والے ہیں۔ وہ اس میں ایک لمبے عرصہ تک رہنے والے ہیں۔","English":"Aye, whoso does evil and is encompassed by his sins — those are the inmates of the Fire; therein shall they abide.","German":"Wahrlich, wer da übel tut und verstrickt ist in seinen Sünden – diese sind die Bewohner des Feuers; darin müssen sie bleiben.","Spanish":" ¡Ay de aquél que hace el mal y está rodeado de sus pecados!: Ésos son los prisioneros del Fuego; en él morarán.","French":"En vérité, quiconque fait le mal et est entouré de ses péchés – ceux-là sont les compagnons du Feu. Ils y demeureront longtemps.","UrduTS":"کیوں نہیں‘ جو لوگ بھی کسی قسم کی بدی کمائیں گے اور ان کا گناہ انہیں (چاروں طرف سے) گھیر لے گا وہ دوزخ (میں پڑنے) والے ہیں۔ وہ اس میں (پڑے) رہیں گے۔ ","a":82,"s":2}
{"index":{"_id":90}}
{"Surah":"سورة البَقَرَة","ayah":"2:83","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Ruku_sw":10,"Ruku_sw_per_Juz":10,"Juz":1,"Manzil":1,"Ruku":10,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلْجَنَّةِ ۖ هُمْ فِيهَا خَٰلِدُونَ","Urdu":"اور وہ لوگ جو ایمان لائے اور نیک اعمال بجالائے یہی ہیں جو اہلِ جنت ہیں ۔ وہ اس میں ہمیشہ رہنے والے ہیں۔","English":"But they who believe and do good works — those are the dwellers of Heaven; therein shall they abide.","German":"Die aber glauben und gute Werke tun – diese sind die Bewohner des Himmels; darin sollen sie bleiben.","Spanish":" Pero los que creen y hacen buenas obras: ésos son los habitantes del Cielo; en él morarán eternamente.","French":"Mais ceux qui croient et font de bonnes oeuvres – voilà les habitants du Paradis. Ils y demeureront éternellement.","UrduTS":"اور جو لوگ ایمان لائے ہیں اور انہوں نے نیک عمل کیے ہیں وہ جنت (میں جانے) والے ہیں۔ وہ اس میں (ہمیشہ) بسیں گے۔ ","a":83,"s":2}
{"index":{"_id":91}}
{"Surah":"سورة البَقَرَة","ayah":"2:84","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":11,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ أَخَذْنَا مِيثَٰقَ بَنِىٓ إِسْرَٰٓءِيلَ لَا تَعْبُدُونَ إِلَّا ٱللَّهَ وَبِٱلْوَٰلِدَيْنِ إِحْسَانًا وَذِى ٱلْقُرْبَىٰ وَٱلْيَتَٰمَىٰ وَٱلْمَسَٰكِينِ وَقُولُوا۟ لِلنَّاسِ حُسْنًا وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ ثُمَّ تَوَلَّيْتُمْ إِلَّا قَلِيلًا مِّنكُمْ وَأَنتُم مُّعْرِضُونَ","Urdu":"اور جب ہم نے بنی اسرائیل کا میثاق (اُن سے) لیا کہ اللہ کے سوا کسی کی عبادت نہیں کرو گے اور والدین سے احسان کا سلوک کروگے اور قریبی رشتہ داروں سے اور یتیموں سے اور مسکینوں سے بھی۔ اور لوگوں سے نیک بات کہا کرو اور نماز کو قائم کرو اور زکوٰۃ ادا کرو۔ اس کے باوجود تم میں سے چند کے سوا تم سب (اس عہد سے) پھر گئے۔ اور تم اِعراض کرنے والے تھے۔","English":"And <i>remember the time</i> when We took a covenant from the children of Israel: ‘You shall worship <i>nothing</i> but Allah and <i>show</i> kindness to parents and to kindred and orphans and the poor, and speak to men kindly and observe Prayer, and pay the Zakat;’ then you turned away in aversion, except a few of you.","German":"Und (gedenket der Zeit) da Wir einen Bund schlossen mit den Kindern Israels: \"Ihr sollt nichts anbeten denn Allah; und Güte (erzeigen) den Eltern und den Verwandten und den Waisen und den Armen; und redet Gutes zu den Menschen und verrichtet das Gebet und zahlet die Zakât.\" Ihr aber kehrtet euch späterhin ab in Widerwillen, bis auf einige wenige von euch.","Spanish":" Y <em>acordaos</em> de cuando aceptamos una alianza de los Hijos de Israel: “No adoréis sino a Al-lah, sed buenos con los padres, los parientes, los huérfanos y los pobres; hablad bondadosamente a los hombres, cumplid la Oración y pagad el <em>Zakat,</em>”; entonces volvisteis la espalda alejándoos, excepto unos cuantos.","French":"Et <em>souvenez-vous</em> quand Nous avons pris un engagement avec les Enfants d’Israël : « Vous ne devez <em>rien</em> adorer d’autre qu’Allāh ; vous serez bons envers vos parents et vos proches, envers les orphelins et les pauvres. Vous devez parler avec bienveillance aux hommes, observer la Prière et payer la Zakāt » ; alors, à part quelques-uns d’entre vous, vous avez tous tourné le dos <em>à cet engagement</em>, en aversion.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب ہم نے بنی اسرائیل سے پختہ عہد لیا تھا کہ تم اللہ کے سوا کسی کی عبادت نہ کرو گے اور والدین سے احسان (کا معاملہ) کرو گے اور (اسی طرح) قرابت دار یتیموں اور مسکینوں کے ساتھ بھی‘ اور یہ (عہد بھی لیا تھا) کہ لوگوں کے ساتھ ملاطفت کے ساتھ کلام کیا کرو۔ اور نماز کو قائم رکھا کرو اور زکٰوۃ ادا کیا کرو۔ مگر (اس کے بعد) تم میں سے چند ایک کے سوا (باقی) سب (کے سب) اعراض کرتے ہوئے پھر گئے۔ ","a":84,"s":2}
{"index":{"_id":92}}
{"Surah":"سورة البَقَرَة","ayah":"2:85","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":11,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذْ أَخَذْنَا مِيثَٰقَكُمْ لَا تَسْفِكُونَ دِمَآءَكُمْ وَلَا تُخْرِجُونَ أَنفُسَكُم مِّن دِيَٰرِكُمْ ثُمَّ أَقْرَرْتُمْ وَأَنتُمْ تَشْهَدُونَ","Urdu":"اور جب ہم نے تمہارا میثاق لیا کہ تم (آپس میں) اپنا خون نہیں بہاﺅ گے اور اپنے ہی لوگوں کو اپنی آبادیوں سے نہیں نکالو گے اس پر تم نے اقرار کیا اور تم اس کے گوا ہ تھے۔","English":"And <i>remember the time</i> when We took a covenant from you: ‘You shall not shed your blood or turn your people out of your homes;’ then you confirmed <i>it</i>; and you have been witness <i>to it</i>.","German":"Und (gedenket der Zeit) da Wir einen Bund schlossen mit euch: \"Ihr sollt nicht das Blut der Eurigen vergießen oder sie austreiben aus euren Häusern\"; damals bekräftigtet ihr (es); und ihr habt es selber bezeugt.","Spanish":" Y <em>acordaos</em> de cuando acepté la alianza con vosotros: “No derramaréis vuestra propia sangre ni expulsaréis a los vuestros de vuestras casas”; luego <em>lo</em> confirmasteis; y habéis sido testigos <em>de ello</em>.","French":"Et <em>souvenez-vous</em> quand Nous avons fait un pacte avec vous : « Vous ne devez point verser votre sang, ni chasser vos frères de vos demeures. » Ensuite, vous avez confirmé <em>ce pacte,</em> et vous <em>en</em> avez été témoins.","UrduTS":"اور (اس وقت کو بھی یاد کرو) جب ہم نے تم سے عہد لیا تھا کہ تم (آپس میں) اپنے خون نہ بہاٶ گے اور اپنے آپ کو (یعنی اپنی قوم کے لوگوں کو) اپنے گھروں سے نہ نکالو گے اور تم نے (اس کا) اقرار کر لیا تھا اور تم (اس عہد کے متعلق ہمیشہ) گواہی دیتے رہے ہو۔ ","a":85,"s":2}
{"index":{"_id":93}}
{"Surah":"سورة البَقَرَة","ayah":"2:86","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":11,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"ثُمَّ أَنتُمْ هَٰٓؤُلَآءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِّنكُم مِّن دِيَٰرِهِمْ تَظَٰهَرُونَ عَلَيْهِم بِٱلْإِثْمِ وَٱلْعُدْوَٰنِ وَإِن يَأْتُوكُمْ أُسَٰرَىٰ تُفَٰدُوهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ ۚ أَفَتُؤْمِنُونَ بِبَعْضِ ٱلْكِتَٰبِ وَتَكْفُرُونَ بِبَعْضٍ ۚ فَمَا جَزَآءُ مَن يَفْعَلُ ذَٰلِكَ مِنكُمْ إِلَّا خِزْىٌ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَيَوْمَ ٱلْقِيَٰمَةِ يُرَدُّونَ إِلَىٰٓ أَشَدِّ ٱلْعَذَابِ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ","Urdu":"اس کے باوجود تم وہ ہو کہ اپنے ہی لوگوں کو قتل کرتے ہو اور تم اپنے میں سے ایک فریق کو اُن کی بستیوں سے نکالتے ہو۔ تم گناہ اور ظلم کے ذریعہ ان کے خلاف ایک دوسرے کی پُشت پناہی کرتے ہو اور اگر وہ قیدی ہو کر تمہارے پاس آئیں تو فدیہ لے کر اُن کو چھوڑ دیتے ہو جبکہ ان کا نکالنا ہی تم پر حرام تھا۔ پس کیا تم کتاب کے بعض حصوں پر ایمان لاتے ہو اور بعض کا انکار کرتے ہو؟۔ پس تم میں سے جو ایسا کرے اس کی جزا دنیا کی زندگی میں سخت ذلّت کے سوا اور کیا ہو سکتی ہے۔ اور قیامت کے دن وہ سخت تر عذاب کی طرف لوٹائے جائیں گے ۔ اور اللہ اس سے غافل نہیں جو تم کرتے ہو۔","English":"Yet you are the people who slay your own brethren and turn out a section of your people from their homes, backing up one another against them with sin and transgression. And if they come to you as captives, you ransom them, while their <i>very</i> expulsion was unlawful for you. Do you, then, believe in part of the Book and disbelieve in part? There is, therefore, no reward for such among you as do this, except disgrace in the present life; and on the Day of Judgment they shall be driven to a most severe chastisement; and surely, Allah is not unmindful of what you do.","German":"Dennoch seid ihr Leute, die ihr einander erschlagt und einen Teil der Eurigen aus ihren Häusern treibt, einer den anderen stützend gegen sie mit Sünde und Missetat. Und wenn sie als Gefangene zu euch kommen, kauft ihr sie los, obwohl ihre Austreibung selbst für euch ungesetzlich war. Glaubt ihr denn nur an einen Teil des Buches und verwerft den anderen? Es gibt darum keinen Lohn für jene unter euch, die also tun, denn Schande in diesem Leben, und am Tage der Auferstehung sollen sie der schwersten Strafe überantwortet werden; und Allah ist nicht achtlos eures Tuns.","Spanish":" No obstante, sois de los que matan a sus propios hermanos y expulsan a parte de vuestro pueblo de sus casas, ayudándoos mutuamente contra ellos con pecado y trasgresión. Y si os llegan como prisioneros, los rescatáis, aunque <em>el hecho mismo de</em> su expulsión sea ilegal para vosotros. ¿Acaso creéis en <em>una </em>parte del Libro y no creéis en <em>otra</em> parte? No hay pues recompensa alguna para aquellos de vosotros que así actúen, salvo la desgracia en esta vida; y en el Día del Juicio serán conducidos al más terrible castigo; y, en verdad, Al-lah no ignora lo que hacéis.","French":"Et pourtant, c’est vous qui vous vous entre-tuez, et qui chassez de chez eux certains de vos gens en soutenant leurs ennemis contre eux dans le péché et la transgression. Et s’ils tombent entre vos mains comme captifs, vous les rançonnez, alors que <em>même</em> les chasser <em>de chez eux</em> vous était interdit. Alors, croyez-vous en une partie du Livre en refusant de croire en une autre partie ? Quelle peut être alors la récompense pour ceux d’entre vous qui agissent ainsi, sauf le déshonneur dans la vie d’ici-bas ; et au Jour du Jugement, ils seront refoulés au châtiment le plus sévère ; et assurément Allāh n’est pas inattentif à ce que vous faites.","UrduTS":"پھر تم لوگ ہی ہو کہ (اس عہد کے باوجود) آپس میں ایک دوسرے کو قتل کرتے ہو اور اپنے میں سے ایک جماعت کو گناہ اور ظلم کے ساتھ (ان کے دشمنوں کی) مدد کرتے ہوئے ان کے گھروں سے نکالتے ہو اور اگر وہ تمہارے پاس قیدی ہو کر  (مدد مانگنے کے لئے) آئیں تو تم فدیہ دیکر انہیں چھڑا لیتے ہو گو حقیقتا ان کا (گھروں سے) نکالنا (بھی) تم پر حرام کیا گیا تھا۔ تو کیا تم کتاب کے ایک حصہ پر تو ایمان لاتے ہو اور ایک حصہ کا انکار کرتے ہو۔ پس تم میں سے جو ایسا کرتے ہیں ان کی سزا اس (جہان کی) زندگی (ہی) میں رسوائی (اٹھانے) کے سوا اور کیا ہے (جو انہیں ملے گی) اور وہ قیامت کے دن اس سے بھی سخت عذاب کی طرف لوٹائے جائیں گے اور جو کچھ تم کر رہے ہو اللہ اس سے ہر گز بے خبر نہیں۔ ","a":86,"s":2}
{"index":{"_id":94}}
{"Surah":"سورة البَقَرَة","ayah":"2:87","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Ruku_sw":11,"Ruku_sw_per_Juz":11,"Juz":1,"Manzil":1,"Ruku":11,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"أُو۟لَٰٓئِكَ ٱلَّذِينَ ٱشْتَرَوُا۟ ٱلْحَيَوٰةَ ٱلدُّنْيَا بِٱلْءَاخِرَةِ ۖ فَلَا يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ وَلَا هُمْ يُنصَرُونَ","Urdu":"یہی وہ لوگ ہیں جنہوں نے آخرت کے بدلے دنیا کی زندگی خرید لی ۔ پس نہ ان سے عذاب کو کم کیا جائے گا اور نہ ہی وہ مدد دئیے جائیں گے۔","English":"These are they who have preferred the present life to the Hereafter. Their punishment shall not therefore be lightened, nor shall they be helped <i>in any other way</i>.","German":"Diese sind es, die das jetzige Leben dem künftigen vorgezogen haben. Ihre Strafe soll darum nicht gemildert noch soll ihnen sonst Beistand werden.","Spanish":" Son éstos los que han preferido la presente vida a la Futura. Su castigo no será pues, aliviado, ni serán auxiliados <em>de ninguna otra manera.</em>","French":"Voilà ceux qui ont préféré la vie de ce monde à la vie future. Leur châtiment ne sera donc pas atténué et ils ne seront secourus <em>d’aucune autre manière.</em>","UrduTS":"اور یہی وہ لوگ ہیں جنہوں نے اس (جہان کی) زندگی کو بعد میں آنے والی (زندگی) پر مقدم کر لیا ہے اس لئے نہ تو ان سے عذاب ہی ہلکا کیا جائے گا اور نہ ان کی (کسی اور رنگ میں) مدد کی جائے گی۔ ","a":87,"s":2}
{"index":{"_id":95}}
{"Surah":"سورة البَقَرَة","ayah":"2:88","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":12,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَلَقَدْ ءَاتَيْنَا مُوسَى ٱلْكِتَٰبَ وَقَفَّيْنَا مِنۢ بَعْدِهِۦ بِٱلرُّسُلِ ۖ وَءَاتَيْنَا عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَٰتِ وَأَيَّدْنَٰهُ بِرُوحِ ٱلْقُدُسِ ۗ أَفَكُلَّمَا جَآءَكُمْ رَسُولٌۢ بِمَا لَا تَهْوَىٰٓ أَنفُسُكُمُ ٱسْتَكْبَرْتُمْ فَفَرِيقًا كَذَّبْتُمْ وَفَرِيقًا تَقْتُلُونَ","Urdu":"اور یقیناً ہم نے موسیٰ کو کتاب دی اور اس کے بعد بھی مسلسل رسول بھیجتے رہے۔ اور ہم نے عیسیٰ ابن مریم کو کھلے کھلے نشان عطا کئے اور ہم نے روح القدس سے اس کی تائید کی ۔ پس کیا جب بھی تمہارے پاس کوئی رسول ایسی باتیں لے کر آئے گا جو تمہیں پسند نہیں تو تم استکبار کروگے ؟۔ اور ان میں سے بعض کو تم جھٹلا دو گے اور بعض کو تم قتل کروگے؟","English":"And verily, We gave Moses the Book and caused after him Messengers to follow in his footsteps; and to Jesus, son of Mary, We gave manifest Signs, and strengthened him with the Spirit of holiness. Will you then, every time a Messenger comes to you with what you yourselves desire not, behave arrogantly and treat some as liars and slay others?","German":"Wir gaben Moses fürwahr das Buch und ließen Gesandte folgen in seinen Fußstapfen; und Jesus, dem Sohn der Maria, gaben Wir offenkundige Zeichen und stärkten ihn mit dem Geiste der Heiligkeit. Wollt ihr denn, jedesmal da ein Bote zu euch kommt mit dem, was ihr selbst nicht wünschet, hoffärtig sein und einige als Lügner behandeln und andere erschlagen?","Spanish":" Y en verdad Dimos a Moisés el Libro y enviamos a Mensajeros tras él, para que siguieran sus pasos; y a Jesús, hijo de María, dimos Signos manifiestos y lo fortalecimos con el Espíritu de santidad. ¿Es que cada vez que os llegue un Mensajero con lo que no deseéis, os comportaréis con arrogancia, trataréis a unos de mentirosos y mataréis a otros?","French":"Et en vérité, Nous avons donné le Livre à Moïse, et après lui, Nous avons envoyé des Messagers successifs. Nous avons donné des Signes manifestes à Jésus, fils de Marie, et Nous l’avons fortifié de l’Esprit de Sainteté. Toutes les fois qu’un Messager viendra vous apporter ce que vous ne désirez point, allez-vous agir avec arrogance ; traitant d’aucuns de menteurs et tuant d’autres ?","UrduTS":"اور ہم نے (یقیناً) موسیٰ کو کتاب دی تھی اور اس کے بعد ہم نے (ان) رسولوں کو (جنہیں تم جانتے ہو اس کے) پیچھے بھیجا اور عیسیٰ ابن مریم کو (بھی) ہم نے کھلے کھلے نشانات دئیے اور روح القدس کے ذریعہ اسے طاقت بخشی (لیکن تم نے سب کا مقابلہ کیا) تو پھر (تم ہی بتاٶ کہ) کیا (یہ بات ناپسندیدہ نہیں کہ) جب بھی تمہارے پاس کوئی رسول اس (تعلیم) کو لے کر آیا جسے تمہارے نفس پسند نہیں کرتے تھے تو تم نے تکبر (کا مظاہرہ) کیا چنانچہ بعض کو تم نے جھٹلا دیا اور بعض کو قتل کر دیا۔ ","a":88,"s":2}
{"index":{"_id":96}}
{"Surah":"سورة البَقَرَة","ayah":"2:89","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":12,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَقَالُوا۟ قُلُوبُنَا غُلْفٌۢ ۚ بَل لَّعَنَهُمُ ٱللَّهُ بِكُفْرِهِمْ فَقَلِيلًا مَّا يُؤْمِنُونَ","Urdu":"اور انہوں نے کہا ہمارے دل مجسّم پردہ ہیں۔ حقیقت یہ ہے کہ اللہ نے ان کے کفر کی وجہ سے ان پر لعنت ڈال رکھی ہے۔ پس وہ کم ہی ایمان لاتے ہیں۔","English":"They said: ‘Our hearts are wrapped in covers.’ Nay, Allah has cursed them for their disbelief. Little is that which they believe.","German":"Sie sprechen: \"Unsere Herzen sind in Hüllen gewickelt.\" Nein, Allah hat sie verflucht um ihres Unglaubens willen. Gering ist also, was sie glauben.","Spanish":" Dijeron, “Nuestros corazones están rodeados por una envoltura”. ¡No!, Al-lah los ha maldecido por su incredulidad. En muy pocas cosas creen.","French":"Et ils dirent : « Nos cœurs sont <em>enveloppés dans</em> des voiles. » En vérité Allāh les a maudits à cause de leur manque de foi. <em>En somme</em>, ils ont peu de foi.","UrduTS":"اور (ہمیں معلوم ہے کہ) انہوں نے (یہ بھی) کہا  ہے (کہ) ہمارے دل تو پردوں میں ہیں (مگر یہ بات) نہیں‘ بلکہ اللہ نے ان کے کفر کے سبب سے ان پر لعنت کی ہے پس وہ بہت ہی کم ایمان لاتے ہیں۔ ","a":89,"s":2}
{"index":{"_id":97}}
{"Surah":"سورة البَقَرَة","ayah":"2:90","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":12,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَلَمَّا جَآءَهُمْ كِتَٰبٌ مِّنْ عِندِ ٱللَّهِ مُصَدِّقٌ لِّمَا مَعَهُمْ وَكَانُوا۟ مِن قَبْلُ يَسْتَفْتِحُونَ عَلَى ٱلَّذِينَ كَفَرُوا۟ فَلَمَّا جَآءَهُم مَّا عَرَفُوا۟ كَفَرُوا۟ بِهِۦ ۚ فَلَعْنَةُ ٱللَّهِ عَلَى ٱلْكَٰفِرِينَ","Urdu":" اور جب اللہ کی طرف سے ان کے پاس ایک ایسی کتاب آئی جو اُس (تعلیم) کی جو اُن کے پاس تھی تصدیق کررہی تھی جبکہ حال یہ تھا کہ اس سے پہلے وہ ان لوگوں کے خلاف جنہوں نے کفر کیا (اللہ سے) مدد مانگا کرتے تھے ۔ پس جب وہ اُن کے پاس آگیا جسے انہوں نے پہچان لیا تو (پھر بھی) اُس کا انکار کردیا ۔ پس کافروں پر اللہ کی لعنت ہو۔","English":"And when there came to them a Book from Allah, fulfilling that which is with them — and before that they had prayed for victory over the disbelievers — yet when there came to them that which they knew, they rejected it. The curse of Allah be on the disbelievers.","German":"Und als ihnen ein Buch von Allah zukam, bestätigend das, was sie haben – und sie hatten zuvor um Sieg gefleht über die Ungläubigen –, dennoch, als ihnen zukam, was sie doch kannten, da verwarfen sie es. Darum Allahs Fluch auf die Ungläubigen!","Spanish":" Y cuando les llegó un Libro enviado por Al-lah, cumpliendo lo que ya tenían, –y antes de eso habían implorado la victoria sobre los incrédulos-, no obstante, cuando les llegó lo que ya sabían, lo rechazaron. ¡Que la maldición de Dios caiga sobre los incrédulos!","French":"Quand il leur vint un Livre de la part d’Allāh accomplissant ce qui est déjà avec eux – et auparavant, ils avaient demandé <em>à Allāh</em> la victoire sur les mécréants – cependant quand il leur vint ce qu’ils savaient<em> être la vérité</em>, ils le rejetèrent. Que la malédiction d’Allāh soit sur les mécréants !","UrduTS":"اور جب ان کے پاس اللہ کی طرف سے ایک کتاب آئی جو اس (کتاب کی پیشگوئیوں) کو جو ان کے پاس ہے سچا کرنے والی ہے تو باوجود اس کے کہ پہلے یہ (لوگ اللہ سے) کافروں پر فتح (پانے کی دعا) مانگا کرتے تھے۔ جب ان کے پاس وہ چیز آگئی جس کو انہوں نے پہچان لیا تو اس کا انکار کر دیا۔ پس ایسے کافروں پر اللہ کی لعنت ہے۔ ","a":90,"s":2}
{"index":{"_id":98}}
{"Surah":"سورة البَقَرَة","ayah":"2:91","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":12,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"بِئْسَمَا ٱشْتَرَوْا۟ بِهِۦٓ أَنفُسَهُمْ أَن يَكْفُرُوا۟ بِمَآ أَنزَلَ ٱللَّهُ بَغْيًا أَن يُنَزِّلَ ٱللَّهُ مِن فَضْلِهِۦ عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِۦ ۖ فَبَآءُو بِغَضَبٍ عَلَىٰ غَضَبٍ ۚ وَلِلْكَٰفِرِينَ عَذَابٌ مُّهِينٌ","Urdu":"بہت بُرا ہے جو انہوں نے اپنے نفوس بیچ کر ان کے بدلے میں حاصل کیا کہ اُس (حق) کا انکار کر رہے ہیں جو اللہ نے اتارا ۔ اس بات کے خلاف بغاوت کرتے ہوئے کہ اللہ اپنے بندوں میں سے جس پر چاہتا ہے اپنا فضل نازل کرتا ہے ۔ پس وہ غضب پر غضب لئے ہوئے لَوٹے اور کافروں کے لئے رُسواکن عذاب (مقدر) ہے۔","English":"Evil is that for which they have sold their souls: that they should disbelieve in what Allah has revealed, grudging that Allah should send down His grace on whomsoever of His servants He pleases. So they incurred wrath upon wrath; and there is an humiliating chastisement for the disbelievers.","German":"Übel ist das, wofür sie ihre Seelen verkauft haben: dass sie verwerfen sollten, was Allah offenbart hat, aus Wut, weil Allah Seine Huld herabsendet auf wen immer Seiner Diener, der Ihm gefällt. So luden sie (auf sich) Zorn über Zorn; und eine demütigende Strafe wartet der Ungläubigen.","Spanish":" Por maldad es por lo que vendieron sus almas: no creyeron en lo que Al-lah ha revelado, quejándose, por envidia, de que Al-lah enviara su gracia a aquellos de Sus siervos que deseara. De este modo, incurrieron en cólera sobre cólera; y hay un ignominioso castigo aguardando a los incrédulos.","French":"Combien est mauvais ce pour lequel ils ont vendu leur âme en ne croyant pas à ce qu’Allāh a révélé et ils voient d’un mauvais œil qu’Allāh puisse accorder quelque grâce de Sa part à n’importe lequel de Ses serviteurs, selon Son plaisir. Ils se sont ainsi attiré courroux sur courroux ; et pour les mécréants il y a un châtiment humiliant.","UrduTS":"وہ امر بہت ہی برا ہے جس کے بدلہ میں انہوں نے اپنی جانوں کو بیچ رکھا ہے (اور) وہ ان کا اللہ کے اتارے ہوئے کلام سے اس بات پر بگڑ کر انکار کرنا ہے کہ اللہ اپنے بندوں میں سے جس پر چاہتا ہے (کیوں) اپنا فضل نازل کر دیتا ہے۔  پس یہ لوگ غضب کے بعد غضب کا مورد ہو گئے ہیں۔ اور ایسے (ہی) کافروں کے لئے رسوا کرنے والا عذاب (مقدر) ہے۔ ","a":91,"s":2}
{"index":{"_id":99}}
{"Surah":"سورة البَقَرَة","ayah":"2:92","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","Juz":1,"Manzil":1,"Ruku":12,"Hisb":5,"Sajda_id":"","Sajda_Obligation":"","Arabic":"وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ بِمَآ أَنزَلَ ٱللَّهُ قَالُوا۟ نُؤْمِنُ بِمَآ أُنزِلَ عَلَيْنَا وَيَكْفُرُونَ بِمَا وَرَآءَهُۥ وَهُوَ ٱلْحَقُّ مُصَدِّقًا لِّمَا مَعَهُمْ ۗ قُلْ فَلِمَ تَقْتُلُونَ أَنۢبِيَآءَ ٱللَّهِ مِن قَبْلُ إِن كُنتُم مُّؤْمِنِينَ","Urdu":"اور جب ان سے کہا جاتا ہے کہ اس پر ایمان لے آؤ جو اللہ نے نازل کیا ہے۔ وہ کہتے ہیں کہ ہم اس پر ایمان لے آئے ہیں جو ہم پر اُتارا گیا جبکہ وہ اس کا انکار کرتے ہیں جو اس کے علاوہ (اُتارا گیا) ہے حالانکہ وہ حق ہے جو اُس کی تصدیق کررہا ہے جو اُن کے پاس ہے۔ تُو کہہ دے اگر تم واقعی مومن ہو تو اس سے قبل اللہ کے نبیوں کو کیوں قتل کیا کرتے تھے؟","English":"And when it is said to them: ‘Believe in what Allah has sent down,’ they say: ‘We believe in what has been sent down to us;’ and they disbelieve in what <i>has been sent down</i> after that, yet it is the Truth, fulfilling that which is with them. Say: ‘Why, then, did you attempt to slay the Prophets of Allah before this, if you were believers?’","German":"Und wenn ihnen gesagt wird: \"Glaubet an das, was Allah niedersandte\", sagen sie: \"Wir glauben an das, was auf uns niedergesandt ward\"; sie glauben aber nicht an das hernach (Gesandte), obwohl es die Wahrheit ist und das bekräftigt, was sie haben. Sprich: \"Warum habt ihr denn immer gewollt, die Propheten Allahs zu erschlagen, wenn ihr Gläubige waret?\"","Spanish":" Y cuando se les dice: “Creed en lo que Al-lah ha revelado”, responden: “Creemos en lo que se nos ha revelado”; pero no creen en lo que <em>ha sido revelado</em> posteriormente, aunque es la Verdad, que cumple lo que ya tienen. Diles: “¿Por qué, pues, intentasteis matar a los Profetas de Al-lah con anterioridad, si erais creyentes?”.","French":"Et lorsqu’on leur dit : « Croyez à ce qu’Allāh a envoyé, » ils répondent : « Nous croyons à ce qui nous a été envoyé » et ils ne veulent pas croire à ce qui est<em> révélé</em> en dehors de cela, bien que ce soit la Vérité qui accomplit ce qu’ils ont déjà. Dis-<em>leur</em> : « Pourquoi donc avez-vous essayé de tuer les prophètes d’Allāh avant cela, si vous étiez croyants ? »","UrduTS":"اور جب ان سے کہا جائے کہ جو کچھ اللہ نے اتارا ہے اس پر ایمان لاٶ تو وہ کہتے ہیں کہ ہم (تو) اس پر ایمان لاتے ہیں جو ہم پر اتارا گیا ہے اور (یہ کہتے ہوئے) اس کے بعد آنے والے (کلام) کا وہ انکار کر دیتے ہیں‘ حالانکہ وہ اس (کلام) کو جو ان کے پاس ہے سچا کرکے کامل طور پر سچا (ثابت ہو چکا) ہے۔ تو (ان سے) کہہ کہ اگر تم (واقعی) مومن ہو تو پھر تم کیوں اس سے پہلے اللہ کے نبیوں کے قتل کے درپے رہے ہو۔ ","a":92,"s":2}
{"index":{"_id":100}}
{"Surah":"سورة البَقَرَة","ayah":"2:93","Surah_EN_transliteration":"Al-Baqara","Surah_EN_translation":"The Cow","Surah_Revelation":"Medinan","hisQ_sw":6,"Juz":1,"Manzil":1,"Ruku":12,"Hisb":6,"Sajda_id":"","Sajda_Obligation":"","Arabic":"۞ وَلَقَدْ جَآءَكُم مُّوسَىٰ بِٱلْبَيِّنَٰتِ ثُمَّ ٱتَّخَذْتُمُ ٱلْعِجْلَ مِنۢ بَعْدِهِۦ وَأَنتُمْ ظَٰلِمُونَ","Urdu":"اور یقینا موسیٰ تمہارے پاس کھلے کھلے نشان لایا تھا۔ پھر اس کی غیرحاضری میں تم نے بچھڑے کو (معبود) بنا لیا اور تم ظالم تھے۔","English":"And Moses came to you with manifest Signs, then you took the calf <i>for worship</i> in his absence and you were transgressors.","German":"Und Moses kam zu euch mit offenbaren Zeichen, ihr aber nahmt euch das Kalb in seiner Abwesenheit, und ihr waret Frevler.","Spanish":" Y Moisés vino a vosotros con Signos manifiestos, pero tomasteis en su ausencia al becerro <em>para adorarlo,</em> y fuisteis pecadores.","French":"Et, en vérité, Moïse est venu à vous avec des Signes manifestes. Ensuite, vous avez pris le veau <em>en adoration</em> pendant son absence et vous avez été des transgresseurs.","UrduTS":"اور موسیٰ تمہارے پاس یقیناً کھلے کھلے نشان لے کر آیا تھا پھر (بھی) تم نے اس کے (پہاڑ پر جانے کے) بعد ظلم کرتے ہوئے (خداتعالیٰ کو چھوڑ کر) بچھڑے کو (معبود) بنا لیا۔ ","a":93,"s":2}
